$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.3.0',
          'Headers' => {
                         'rfbclient.h' => 1,
                         'rfbproto.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libvncclient.so.0.9.14',
          'LibraryVersion' => 'v1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libgcrypt.so.20' => 1,
                        'libgnutls.so.30' => 1,
                        'libjpeg.so.8' => 1,
                        'liblzo2.so.2' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'cursor.c' => 1,
                         'listen.c' => 1,
                         'rfbproto.c' => 1,
                         'sockets.c' => 1,
                         'vncviewer.c' => 1
                       },
          'SymbolInfo' => {
                            '100680' => {
                                          'Header' => 'rfbclient.h',
                                          'Param' => {
                                                       '0' => {
                                                                'name' => 'client',
                                                                'type' => '4962'

                                                       'encrypt_rfbdes' => 1,
                                                       'errorMessageOnReadFailure' => -1,
                                                       'hash_md5' => 1,
                                                       'hash_sha1' => 1,
                                                       'listenForIncomingConnections' => 1,
                                                       'listenForIncomingConnectionsNoFork' => 1,
                                                       'random_bytes' => 1,
                                                       'rfbClientCleanup' => 1,
                                                       'rfbClientEncryptBytes' => 1,
                                                       'rfbClientEncryptBytes2' => 1,
                                                       'rfbClientErr' => -8,
                                                       'rfbClientExtensions' => -8,
                                                       'rfbClientGetClientData' => 1,
                                                       'rfbClientLog' => -8,
                                                       'rfbClientRegisterExtension' => 1,
                                                       'rfbClientSetClientData' => 1,
                                                       'rfbEnableClientLogging' => -1,
                                                       'rfbGetClient' => 1,
                                                       'rfbHandleAuthResult' => 1,
                                                       'rfbInitClient' => 1,
                                                       'sock_set_nonblocking' => 1,
                                                       'sock_wait_for_connected' => 1,
                                                       'tjBufSize' => 1,
                                                       'tjCompress' => 1,
                                                       'tjCompress2' => 1,
                                                       'tjDecompress' => 1,
                                                       'tjDecompress2' => 1,
                                                       'tjDecompressHeader' => 1,
                                                       'tjDecompressHeader2' => 1,
                                                       'tjDestroy' => 1,
                                                       'tjGetErrorStr' => 1,
                                                       'tjGetScalingFactors' => 1,
                                                       'tjInitCompress' => 1,
                                                       'tjInitDecompress' => 1,
                                                       'zywrleSynthesize16LE' => 1,
                                                       'zywrleSynthesize32LE' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1011' => {
                                      'BaseType' => '217',
                                      'Name' => 'char[40]',
                                      'Size' => '40',
                                      'Type' => 'Array'
                                    },
                          '101940' => {
                                        'BaseType' => '64',
                                        'Name' => 'unsigned int*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1027' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '72',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__data',
                                                           'offset' => '0',
                                                           'type' => '847'
                                                         },
                                                  '1' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '1011'
                                                         },
                                                  '2' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '156'
                                                         }
                                                },
                                      'Name' => 'union pthread_mutex_t',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Union'
                                    },
                          '1039' => {
                                      'BaseType' => '224',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1045' => {
                                      'BaseType' => '106',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1057' => {
                                      'BaseType' => '1045',
                                      'Name' => 'uint8_t const',
                                      'Size' => '1',
                                      'Type' => 'Const'
                                    },
                          '106' => {
                                     'BaseType' => '73',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1062' => {
                                      'BaseType' => '125',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1074' => {
                                      'BaseType' => '144',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1086' => {
                                      'BaseType' => '73',
                                      'Header' => 'zconf.h',
                                      'Line' => '391',
                                      'Name' => 'Byte',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '10912' => {
                                       'BaseType' => '10925',
                                       'Header' => 'rfbclient.h',
                                       'Line' => '499',
                                       'Name' => 'rfbClientLogProc',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '10925' => {
                                       'Name' => 'void(*)(char const*, ...)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '1039'
                                                           },
                                                    '1' => {
                                                             'type' => '-1'
                                                           }
                                                  },
                                       'Return' => '1',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '10969' => {
                                       'BaseType' => '137',
                                       'Name' => 'int*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1099' => {
                                      'BaseType' => '64',
                                      'Header' => 'zconf.h',
                                      'Line' => '393',
                                      'Name' => 'uInt',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '110169' => {
                                        'BaseType' => '211',
                                        'Name' => 'char**',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1112' => {
                                      'BaseType' => '57',
                                      'Header' => 'zconf.h',
                                      'Line' => '394',
                                      'Name' => 'uLong',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1125' => {
                                      'BaseType' => '1086',
                                      'Header' => 'zconf.h',
                                      'Line' => '400',
                                      'Name' => 'Bytef',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1138' => {
                                      'BaseType' => '71',
                                      'Header' => 'zconf.h',
                                      'Line' => '409',
                                      'Name' => 'voidpf',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1151' => {
                                      'BaseType' => '1163',
                                      'Header' => 'zlib.h',
                                      'Line' => '81',
                                      'Name' => 'alloc_func',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1163' => {
                                      'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1138'
                                                          },
                                                   '1' => {
                                                            'type' => '1099'
                                                          },
                                                   '2' => {
                                                            'type' => '1099'
                                                          }
                                                 },
                                      'Return' => '1138',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '118' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1194' => {
                                      'BaseType' => '1206',
                                      'Header' => 'zlib.h',
                                      'Line' => '82',
                                      'Name' => 'free_func',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1206' => {
                                      'Name' => 'void(*)(voidpf, voidpf)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1138'
                                                          },
                                                   '1' => {
                                                            'type' => '1138'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1228' => {
                                      'Header' => 'zlib.h',
                                      'Line' => '86',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_in',
                                                           'offset' => '0',
                                                           'type' => '1424'
                                                         },
                                                  '1' => {
                                                           'name' => 'avail_in',
                                                           'offset' => '8',
                                                           'type' => '1099'
                                                         },
                                                  '10' => {
                                                            'name' => 'opaque',
                                                            'offset' => '128',
                                                            'type' => '1138'
                                                          },
                                                  '11' => {
                                                            'name' => 'data_type',
                                                            'offset' => '136',
                                                            'type' => '137'
                                                          },
                                                  '12' => {
                                                            'name' => 'adler',
                                                            'offset' => '150',
                                                            'type' => '1112'
                                                          },
                                                  '13' => {
                                                            'name' => 'reserved',
                                                            'offset' => '260',
                                                            'type' => '1112'
                                                          },
                                                  '2' => {
                                                           'name' => 'total_in',
                                                           'offset' => '22',
                                                           'type' => '1112'
                                                         },
                                                  '3' => {
                                                           'name' => 'next_out',
                                                           'offset' => '36',
                                                           'type' => '1424'
                                                         },
                                                  '4' => {
                                                           'name' => 'avail_out',
                                                           'offset' => '50',
                                                           'type' => '1099'
                                                         },
                                                  '5' => {
                                                           'name' => 'total_out',
                                                           'offset' => '64',
                                                           'type' => '1112'
                                                         },
                                                  '6' => {
                                                           'name' => 'msg',
                                                           'offset' => '72',
                                                           'type' => '211'
                                                         },
                                                  '7' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '1435'
                                                         },
                                                  '8' => {
                                                           'name' => 'zalloc',
                                                           'offset' => '100',
                                                           'type' => '1151'
                                                         },
                                                  '9' => {
                                                           'name' => 'zfree',
                                                           'offset' => '114',
                                                           'type' => '1194'
                                                         }
                                                },
                                      'Name' => 'struct z_stream_s',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '125' => {
                                     'BaseType' => '80',
                                     'Header' => 'types.h',
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '12970' => {
                                       'BaseType' => '137',
                                       'Name' => 'int const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '132847' => {
                                        'BaseType' => '12970',
                                        'Name' => 'int const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '132859' => {
                                        'BaseType' => '1039',
                                        'Name' => 'char const*const',
                                        'Size' => '8',
                                        'Type' => 'Const'
                                      },
                          '132869' => {
                                        'BaseType' => '73',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '48',
                                        'Name' => 'JSAMPLE',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '132881' => {
                                        'BaseType' => '118',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '77',
                                        'Name' => 'JCOEF',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '132893' => {
                                        'BaseType' => '73',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '86',
                                        'Name' => 'JOCTET',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '132905' => {
                                        'BaseType' => '132893',
                                        'Name' => 'JOCTET const',
                                        'Size' => '1',
                                        'Type' => 'Const'
                                      },
                          '132910' => {
                                        'BaseType' => '73',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '99',
                                        'Name' => 'UINT8',
                                        'PrivateABI' => 1,
                                        'Size' => '1',
                                        'Type' => 'Typedef'
                                      },
                          '132922' => {
                                        'BaseType' => '80',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '104',
                                        'Name' => 'UINT16',
                                        'PrivateABI' => 1,
                                        'Size' => '2',
                                        'Type' => 'Typedef'
                                      },
                          '132934' => {
                                        'BaseType' => '64',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '159',
                                        'Name' => 'JDIMENSION',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '132946' => {
                                        'BaseType' => '137',
                                        'Header' => 'jmorecfg.h',
                                        'Line' => '207',
                                        'Name' => 'boolean',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Typedef'
                                      },
                          '133307' => {
                                        'BaseType' => '133319',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '69',
                                        'Name' => 'JSAMPROW',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133319' => {
                                        'BaseType' => '132869',
                                        'Name' => 'JSAMPLE*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133325' => {
                                        'BaseType' => '133337',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '70',
                                        'Name' => 'JSAMPARRAY',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133337' => {
                                        'BaseType' => '133307',
                                        'Name' => 'JSAMPROW*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133343' => {
                                        'BaseType' => '133355',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '73',
                                        'Name' => 'JBLOCK',
                                        'PrivateABI' => 1,
                                        'Size' => '128',
                                        'Type' => 'Typedef'
                                      },
                          '133355' => {
                                        'BaseType' => '132881',
                                        'Name' => 'JCOEF[64]',
                                        'Size' => '128',
                                        'Type' => 'Array'
                                      },
                          '133371' => {
                                        'BaseType' => '133383',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '74',
                                        'Name' => 'JBLOCKROW',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133383' => {
                                        'BaseType' => '133343',
                                        'Name' => 'JBLOCK*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133389' => {
                                        'BaseType' => '133401',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '75',
                                        'Name' => 'JBLOCKARRAY',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '133401' => {
                                        'BaseType' => '133371',
                                        'Name' => 'JBLOCKROW*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133443' => {
                                        'BaseType' => '132922',
                                        'Name' => 'UINT16[64]',
                                        'Size' => '128',
                                        'Type' => 'Array'
                                      },
                          '133459' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '98',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'quantval',
                                                             'offset' => '0',
                                                             'type' => '133443'
                                                           },
                                                    '1' => {
                                                             'name' => 'sent_table',
                                                             'offset' => '296',
                                                             'type' => '132946'
                                                           }
                                                  },
                                        'Name' => 'struct JQUANT_TBL',
                                        'PrivateABI' => 1,
                                        'Size' => '132',
                                        'Type' => 'Struct'
                                      },
                          '133522' => {
                                        'BaseType' => '132910',
                                        'Name' => 'UINT8[17]',
                                        'Size' => '17',
                                        'Type' => 'Array'
                                      },
                          '133538' => {
                                        'BaseType' => '132910',
                                        'Name' => 'UINT8[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '133554' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '114',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'bits',
                                                             'offset' => '0',
                                                             'type' => '133522'
                                                           },
                                                    '1' => {
                                                             'name' => 'huffval',
                                                             'offset' => '23',
                                                             'type' => '133538'
                                                           },
                                                    '2' => {
                                                             'name' => 'sent_table',
                                                             'offset' => '630',
                                                             'type' => '132946'
                                                           }
                                                  },
                                        'Name' => 'struct JHUFF_TBL',
                                        'PrivateABI' => 1,
                                        'Size' => '280',
                                        'Type' => 'Struct'
                                      },
                          '133862' => {
                                        'BaseType' => '133459',
                                        'Name' => 'JQUANT_TBL*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '133868' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '187',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'component_id',
                                                             'offset' => '0',
                                                             'type' => '137'
                                                           },
                                                    '1' => {
                                                             'name' => 'component_index',
                                                             'offset' => '4',
                                                             'type' => '137'
                                                           },
                                                    '10' => {
                                                              'name' => 'DCT_v_scaled_size',
                                                              'offset' => '64',
                                                              'type' => '137'
                                                            },
                                                    '11' => {
                                                              'name' => 'downsampled_width',
                                                              'offset' => '68',
                                                              'type' => '132934'
                                                            },
                                                    '12' => {
                                                              'name' => 'downsampled_height',
                                                              'offset' => '72',
                                                              'type' => '132934'
                                                            },
                                                    '13' => {
                                                              'name' => 'component_needed',
                                                              'offset' => '82',
                                                              'type' => '132946'
                                                            },
                                                    '14' => {
                                                              'name' => 'MCU_width',
                                                              'offset' => '86',
                                                              'type' => '137'
                                                            },
                                                    '15' => {
                                                              'name' => 'MCU_height',
                                                              'offset' => '96',
                                                              'type' => '137'
                                                            },
                                                    '16' => {
                                                              'name' => 'MCU_blocks',
                                                              'offset' => '100',
                                                              'type' => '137'
                                                            },
                                                    '17' => {
                                                              'name' => 'MCU_sample_width',
                                                              'offset' => '104',
                                                              'type' => '137'
                                                            },
                                                    '18' => {
                                                              'name' => 'last_col_width',
                                                              'offset' => '114',
                                                              'type' => '137'
                                                            },
                                                    '19' => {
                                                              'name' => 'last_row_height',
                                                              'offset' => '118',
                                                              'type' => '137'
                                                            },
                                                    '2' => {
                                                             'name' => 'h_samp_factor',
                                                             'offset' => '8',
                                                             'type' => '137'
                                                           },
                                                    '20' => {
                                                              'name' => 'quant_table',
                                                              'offset' => '128',
                                                              'type' => '133862'
                                                            },
                                                    '21' => {
                                                              'name' => 'dct_table',
                                                              'offset' => '136',
                                                              'type' => '71'
                                                            },
                                                    '3' => {
                                                             'name' => 'v_samp_factor',
                                                             'offset' => '18',
                                                             'type' => '137'
                                                           },
                                                    '4' => {
                                                             'name' => 'quant_tbl_no',
                                                             'offset' => '22',
                                                             'type' => '137'
                                                           },
                                                    '5' => {
                                                             'name' => 'dc_tbl_no',
                                                             'offset' => '32',
                                                             'type' => '137'
                                                           },
                                                    '6' => {
                                                             'name' => 'ac_tbl_no',
                                                             'offset' => '36',
                                                             'type' => '137'
                                                           },
                                                    '7' => {
                                                             'name' => 'width_in_blocks',
                                                             'offset' => '40',
                                                             'type' => '132934'
                                                           },
                                                    '8' => {
                                                             'name' => 'height_in_blocks',
                                                             'offset' => '50',
                                                             'type' => '132934'
                                                           },
                                                    '9' => {
                                                             'name' => 'DCT_h_scaled_size',
                                                             'offset' => '54',
                                                             'type' => '137'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_component_info',
                                        'PrivateABI' => 1,
                                        'Size' => '96',
                                        'Type' => 'Struct'
                                      },
                          '133997' => {
                                        'BaseType' => '134009',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '201',
                                        'Name' => 'jpeg_saved_marker_ptr',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134009' => {
                                        'BaseType' => '134015',
                                        'Name' => 'struct jpeg_marker_struct*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134015' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '203',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'next',
                                                             'offset' => '0',
                                                             'type' => '133997'
                                                           },
                                                    '1' => {
                                                             'name' => 'marker',
                                                             'offset' => '8',
                                                             'type' => '132910'
                                                           },
                                                    '2' => {
                                                             'name' => 'original_length',
                                                             'offset' => '18',
                                                             'type' => '64'
                                                           },
                                                    '3' => {
                                                             'name' => 'data_length',
                                                             'offset' => '22',
                                                             'type' => '64'
                                                           },
                                                    '4' => {
                                                             'name' => 'data',
                                                             'offset' => '36',
                                                             'type' => '134094'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_marker_struct',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '134094' => {
                                        'BaseType' => '132893',
                                        'Name' => 'JOCTET*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134217' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '242',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'JCS_UNKNOWN',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'JCS_GRAYSCALE',
                                                             'value' => '1'
                                                           },
                                                    '10' => {
                                                              'name' => 'JCS_EXT_XBGR',
                                                              'value' => '10'
                                                            },
                                                    '11' => {
                                                              'name' => 'JCS_EXT_XRGB',
                                                              'value' => '11'
                                                            },
                                                    '12' => {
                                                              'name' => 'JCS_EXT_RGBA',
                                                              'value' => '12'
                                                            },
                                                    '13' => {
                                                              'name' => 'JCS_EXT_BGRA',
                                                              'value' => '13'
                                                            },
                                                    '14' => {
                                                              'name' => 'JCS_EXT_ABGR',
                                                              'value' => '14'
                                                            },
                                                    '15' => {
                                                              'name' => 'JCS_EXT_ARGB',
                                                              'value' => '15'
                                                            },
                                                    '16' => {
                                                              'name' => 'JCS_RGB565',
                                                              'value' => '16'
                                                            },
                                                    '2' => {
                                                             'name' => 'JCS_RGB',
                                                             'value' => '2'
                                                           },
                                                    '3' => {
                                                             'name' => 'JCS_YCbCr',
                                                             'value' => '3'
                                                           },
                                                    '4' => {
                                                             'name' => 'JCS_CMYK',
                                                             'value' => '4'
                                                           },
                                                    '5' => {
                                                             'name' => 'JCS_YCCK',
                                                             'value' => '5'
                                                           },
                                                    '6' => {
                                                             'name' => 'JCS_EXT_RGB',
                                                             'value' => '6'
                                                           },
                                                    '7' => {
                                                             'name' => 'JCS_EXT_RGBX',
                                                             'value' => '7'
                                                           },
                                                    '8' => {
                                                             'name' => 'JCS_EXT_BGR',
                                                             'value' => '8'
                                                           },
                                                    '9' => {
                                                             'name' => 'JCS_EXT_BGRX',
                                                             'value' => '9'
                                                           }
                                                  },
                                        'Name' => 'enum J_COLOR_SPACE',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '134262' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '250',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'JDCT_ISLOW',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'JDCT_IFAST',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'JDCT_FLOAT',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum J_DCT_METHOD',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '134308' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '265',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'JDITHER_NONE',
                                                             'value' => '0'
                                                           },
                                                    '1' => {
                                                             'name' => 'JDITHER_ORDERED',
                                                             'value' => '1'
                                                           },
                                                    '2' => {
                                                             'name' => 'JDITHER_FS',
                                                             'value' => '2'
                                                           }
                                                  },
                                        'Name' => 'enum J_DITHER_MODE',
                                        'PrivateABI' => 1,
                                        'Size' => '4',
                                        'Type' => 'Enum'
                                      },
                          '134321' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '282',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'err',
                                                             'offset' => '0',
                                                             'type' => '134631'
                                                           },
                                                    '1' => {
                                                             'name' => 'mem',
                                                             'offset' => '8',
                                                             'type' => '134834'
                                                           },
                                                    '2' => {
                                                             'name' => 'progress',
                                                             'offset' => '22',
                                                             'type' => '134925'
                                                           },
                                                    '3' => {
                                                             'name' => 'client_data',
                                                             'offset' => '36',
                                                             'type' => '71'
                                                           },
                                                    '4' => {
                                                             'name' => 'is_decompressor',
                                                             'offset' => '50',
                                                             'type' => '132946'
                                                           },
                                                    '5' => {
                                                             'name' => 'global_state',
                                                             'offset' => '54',
                                                             'type' => '137'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_common_struct',
                                        'PrivateABI' => 1,
                                        'Size' => '40',
                                        'Type' => 'Struct'
                                      },
                          '134420' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '720',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'error_exit',
                                                             'offset' => '0',
                                                             'type' => '138118'
                                                           },
                                                    '1' => {
                                                             'name' => 'emit_message',
                                                             'offset' => '8',
                                                             'type' => '138140'
                                                           },
                                                    '10' => {
                                                              'name' => 'last_jpeg_message',
                                                              'offset' => '324',
                                                              'type' => '137'
                                                            },
                                                    '11' => {
                                                              'name' => 'addon_message_table',
                                                              'offset' => '338',
                                                              'type' => '138168'
                                                            },
                                                    '12' => {
                                                              'name' => 'first_addon_message',
                                                              'offset' => '352',
                                                              'type' => '137'
                                                            },
                                                    '13' => {
                                                              'name' => 'last_addon_message',
                                                              'offset' => '356',
                                                              'type' => '137'
                                                            },
                                                    '2' => {
                                                             'name' => 'output_message',
                                                             'offset' => '22',
                                                             'type' => '138118'
                                                           },
                                                    '3' => {
                                                             'name' => 'format_message',
                                                             'offset' => '36',
                                                             'type' => '138162'
                                                           },
                                                    '4' => {
                                                             'name' => 'reset_error_mgr',
                                                             'offset' => '50',
                                                             'type' => '138118'
                                                           },
                                                    '5' => {
                                                             'name' => 'msg_code',
                                                             'offset' => '64',
                                                             'type' => '137'
                                                           },
                                                    '6' => {
                                                             'name' => 'msg_parm',
                                                             'offset' => '68',
                                                             'type' => '138042'
                                                           },
                                                    '7' => {
                                                             'name' => 'trace_level',
                                                             'offset' => '292',
                                                             'type' => '137'
                                                           },
                                                    '8' => {
                                                             'name' => 'num_warnings',
                                                             'offset' => '296',
                                                             'type' => '156'
                                                           },
                                                    '9' => {
                                                             'name' => 'jpeg_message_table',
                                                             'offset' => '310',
                                                             'type' => '138168'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_error_mgr',
                                        'PrivateABI' => 1,
                                        'Size' => '168',
                                        'Type' => 'Struct'
                                      },
                          '134631' => {
                                        'BaseType' => '134420',
                                        'Name' => 'struct jpeg_error_mgr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134637' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '833',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'alloc_small',
                                                             'offset' => '0',
                                                             'type' => '138377'
                                                           },
                                                    '1' => {
                                                             'name' => 'alloc_large',
                                                             'offset' => '8',
                                                             'type' => '138377'
                                                           },
                                                    '10' => {
                                                              'name' => 'self_destruct',
                                                              'offset' => '128',
                                                              'type' => '138118'
                                                            },
                                                    '11' => {
                                                              'name' => 'max_memory_to_use',
                                                              'offset' => '136',
                                                              'type' => '156'
                                                            },
                                                    '12' => {
                                                              'name' => 'max_alloc_chunk',
                                                              'offset' => '150',
                                                              'type' => '156'
                                                            },
                                                    '2' => {
                                                             'name' => 'alloc_sarray',
                                                             'offset' => '22',
                                                             'type' => '138413'
                                                           },
                                                    '3' => {
                                                             'name' => 'alloc_barray',
                                                             'offset' => '36',
                                                             'type' => '138449'
                                                           },
                                                    '4' => {
                                                             'name' => 'request_virt_sarray',
                                                             'offset' => '50',
                                                             'type' => '138495'
                                                           },
                                                    '5' => {
                                                             'name' => 'request_virt_barray',
                                                             'offset' => '64',
                                                             'type' => '138541'
                                                           },
                                                    '6' => {
                                                             'name' => 'realize_virt_arrays',
                                                             'offset' => '72',
                                                             'type' => '138118'
                                                           },
                                                    '7' => {
                                                             'name' => 'access_virt_sarray',
                                                             'offset' => '86',
                                                             'type' => '138582'
                                                           },
                                                    '8' => {
                                                             'name' => 'access_virt_barray',
                                                             'offset' => '100',
                                                             'type' => '138623'
                                                           },
                                                    '9' => {
                                                             'name' => 'free_pool',
                                                             'offset' => '114',
                                                             'type' => '138140'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_memory_mgr',
                                        'PrivateABI' => 1,
                                        'Size' => '104',
                                        'Type' => 'Struct'
                                      },
                          '134834' => {
                                        'BaseType' => '134637',
                                        'Name' => 'struct jpeg_memory_mgr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134840' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '778',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'progress_monitor',
                                                             'offset' => '0',
                                                             'type' => '138118'
                                                           },
                                                    '1' => {
                                                             'name' => 'pass_counter',
                                                             'offset' => '8',
                                                             'type' => '156'
                                                           },
                                                    '2' => {
                                                             'name' => 'pass_limit',
                                                             'offset' => '22',
                                                             'type' => '156'
                                                           },
                                                    '3' => {
                                                             'name' => 'completed_passes',
                                                             'offset' => '36',
                                                             'type' => '137'
                                                           },
                                                    '4' => {
                                                             'name' => 'total_passes',
                                                             'offset' => '40',
                                                             'type' => '137'
                                                           }
                                                  },
                                        'Name' => 'struct jpeg_progress_mgr',
                                        'PrivateABI' => 1,
                                        'Size' => '32',
                                        'Type' => 'Struct'
                                      },
                          '134925' => {
                                        'BaseType' => '134840',
                                        'Name' => 'struct jpeg_progress_mgr*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '134931' => {
                                        'BaseType' => '134944',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '290',
                                        'Name' => 'j_common_ptr',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '134944' => {
                                        'BaseType' => '134321',
                                        'Name' => 'struct jpeg_common_struct*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136095' => {
                                        'BaseType' => '136108',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '292',
                                        'Name' => 'j_decompress_ptr',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '136108' => {
                                        'BaseType' => '136114',
                                        'Name' => 'struct jpeg_decompress_struct*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '136114' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '472',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'err',
                                                             'offset' => '0',
                                                             'type' => '134631'
                                                           },
                                                    '1' => {
                                                             'name' => 'mem',
                                                             'offset' => '8',
                                                             'type' => '134834'
                                                           },
                                                    '10' => {
                                                              'name' => 'jpeg_color_space',
                                                              'offset' => '96',
                                                              'type' => '134217'
                                                            },
                                                    '11' => {
                                                              'name' => 'out_color_space',
                                                              'offset' => '100',
                                                              'type' => '134217'
                                                            },
                                                    '12' => {
                                                              'name' => 'scale_num',
                                                              'offset' => '104',
                                                              'type' => '64'
                                                            },
                                                    '13' => {
                                                              'name' => 'scale_denom',
                                                              'offset' => '114',
                                                              'type' => '64'
                                                            },
                                                    '14' => {
                                                              'name' => 'output_gamma',
                                                              'offset' => '128',
                                                              'type' => '21490'
                                                            },
                                                    '15' => {
                                                              'name' => 'buffered_image',
                                                              'offset' => '136',
                                                              'type' => '132946'
                                                            },
                                                    '16' => {
                                                              'name' => 'raw_data_out',
                                                              'offset' => '146',
                                                              'type' => '132946'
                                                            },
                                                    '17' => {
                                                              'name' => 'dct_method',
                                                              'offset' => '150',
                                                              'type' => '134262'
                                                            },
                                                    '18' => {
                                                              'name' => 'do_fancy_upsampling',
                                                              'offset' => '256',
                                                              'type' => '132946'
                                                            },
                                                    '19' => {
                                                              'name' => 'do_block_smoothing',
                                                              'offset' => '260',
                                                              'type' => '132946'
                                                            },
                                                    '2' => {
                                                             'name' => 'progress',
                                                             'offset' => '22',
                                                             'type' => '134925'
                                                           },
                                                    '20' => {
                                                              'name' => 'quantize_colors',
                                                              'offset' => '264',
                                                              'type' => '132946'
                                                            },
                                                    '21' => {
                                                              'name' => 'dither_mode',
                                                              'offset' => '274',
                                                              'type' => '134308'
                                                            },
                                                    '22' => {
                                                              'name' => 'two_pass_quantize',
                                                              'offset' => '278',
                                                              'type' => '132946'
                                                            },
                                                    '23' => {
                                                              'name' => 'desired_number_of_colors',
                                                              'offset' => '288',
                                                              'type' => '137'
                                                            },
                                                    '24' => {
                                                              'name' => 'enable_1pass_quant',
                                                              'offset' => '292',
                                                              'type' => '132946'
                                                            },
                                                    '25' => {
                                                              'name' => 'enable_external_quant',
                                                              'offset' => '296',
                                                              'type' => '132946'
                                                            },
                                                    '26' => {
                                                              'name' => 'enable_2pass_quant',
                                                              'offset' => '306',
                                                              'type' => '132946'
                                                            },
                                                    '27' => {
                                                              'name' => 'output_width',
                                                              'offset' => '310',
                                                              'type' => '132934'
                                                            },
                                                    '28' => {
                                                              'name' => 'output_height',
                                                              'offset' => '320',
                                                              'type' => '132934'
                                                            },
                                                    '29' => {
                                                              'name' => 'out_color_components',
                                                              'offset' => '324',
                                                              'type' => '137'
                                                            },
                                                    '3' => {
                                                             'name' => 'client_data',
                                                             'offset' => '36',
                                                             'type' => '71'
                                                           },
                                                    '30' => {
                                                              'name' => 'output_components',
                                                              'offset' => '328',
                                                              'type' => '137'
                                                            },
                                                    '31' => {
                                                              'name' => 'rec_outbuf_height',
                                                              'offset' => '338',
                                                              'type' => '137'
                                                            },
                                                    '32' => {
                                                              'name' => 'actual_number_of_colors',
                                                              'offset' => '342',
                                                              'type' => '137'
                                                            },
                                                    '33' => {
                                                              'name' => 'colormap',
                                                              'offset' => '352',
                                                              'type' => '133325'
                                                            },
                                                    '34' => {
                                                              'name' => 'output_scanline',
                                                              'offset' => '360',
                                                              'type' => '132934'
                                                            },
                                                    '35' => {
                                                              'name' => 'input_scan_number',
                                                              'offset' => '370',
                                                              'type' => '137'
                                                            },
                                                    '36' => {
                                                              'name' => 'input_iMCU_row',
                                                              'offset' => '374',
                                                              'type' => '132934'
                                                            },
                                                    '37' => {
                                                              'name' => 'output_scan_number',
                                                              'offset' => '384',
                                                              'type' => '137'
                                                            },
                                                    '38' => {
                                                              'name' => 'output_iMCU_row',
                                                              'offset' => '388',
                                                              'type' => '132934'
                                                            },
                                                    '39' => {
                                                              'name' => 'coef_bits',
                                                              'offset' => '402',
                                                              'type' => '137915'
                                                            },
                                                    '4' => {
                                                             'name' => 'is_decompressor',
                                                             'offset' => '50',
                                                             'type' => '132946'
                                                           },
                                                    '40' => {
                                                              'name' => 'quant_tbl_ptrs',
                                                              'offset' => '512',
                                                              'type' => '137583'
                                                            },
                                                    '41' => {
                                                              'name' => 'dc_huff_tbl_ptrs',
                                                              'offset' => '562',
                                                              'type' => '137599'
                                                            },
                                                    '42' => {
                                                              'name' => 'ac_huff_tbl_ptrs',
                                                              'offset' => '612',
                                                              'type' => '137599'
                                                            },
                                                    '43' => {
                                                              'name' => 'data_precision',
                                                              'offset' => '662',
                                                              'type' => '137'
                                                            },
                                                    '44' => {
                                                              'name' => 'comp_info',
                                                              'offset' => '772',
                                                              'type' => '137577'
                                                            },
                                                    '45' => {
                                                              'name' => 'is_baseline',
                                                              'offset' => '786',
                                                              'type' => '132946'
                                                            },
                                                    '46' => {
                                                              'name' => 'progressive_mode',
                                                              'offset' => '790',
                                                              'type' => '132946'
                                                            },
                                                    '47' => {
                                                              'name' => 'arith_code',
                                                              'offset' => '800',
                                                              'type' => '132946'
                                                            },
                                                    '48' => {
                                                              'name' => 'arith_dc_L',
                                                              'offset' => '804',
                                                              'type' => '137621'
                                                            },
                                                    '49' => {
                                                              'name' => 'arith_dc_U',
                                                              'offset' => '832',
                                                              'type' => '137621'
                                                            },
                                                    '5' => {
                                                             'name' => 'global_state',
                                                             'offset' => '54',
                                                             'type' => '137'
                                                           },
                                                    '50' => {
                                                              'name' => 'arith_ac_K',
                                                              'offset' => '854',
                                                              'type' => '137621'
                                                            },
                                                    '51' => {
                                                              'name' => 'restart_interval',
                                                              'offset' => '882',
                                                              'type' => '64'
                                                            },
                                                    '52' => {
                                                              'name' => 'saw_JFIF_marker',
                                                              'offset' => '886',
                                                              'type' => '132946'
                                                            },
                                                    '53' => {
                                                              'name' => 'JFIF_major_version',
                                                              'offset' => '896',
                                                              'type' => '132910'
                                                            },
                                                    '54' => {
                                                              'name' => 'JFIF_minor_version',
                                                              'offset' => '897',
                                                              'type' => '132910'
                                                            },
                                                    '55' => {
                                                              'name' => 'density_unit',
                                                              'offset' => '898',
                                                              'type' => '132910'
                                                            },
                                                    '56' => {
                                                              'name' => 'X_density',
                                                              'offset' => '900',
                                                              'type' => '132922'
                                                            },
                                                    '57' => {
                                                              'name' => 'Y_density',
                                                              'offset' => '902',
                                                              'type' => '132922'
                                                            },
                                                    '58' => {
                                                              'name' => 'saw_Adobe_marker',
                                                              'offset' => '904',
                                                              'type' => '132946'
                                                            },
                                                    '59' => {
                                                              'name' => 'Adobe_transform',
                                                              'offset' => '914',
                                                              'type' => '132910'
                                                            },
                                                    '6' => {
                                                             'name' => 'src',
                                                             'offset' => '64',
                                                             'type' => '4925'
                                                           },
                                                    '60' => {
                                                              'name' => 'CCIR601_sampling',
                                                              'offset' => '918',
                                                              'type' => '132946'
                                                            },
                                                    '61' => {
                                                              'name' => 'marker_list',
                                                              'offset' => '1024',
                                                              'type' => '133997'
                                                            },
                                                    '62' => {
                                                              'name' => 'max_h_samp_factor',
                                                              'offset' => '1032',
                                                              'type' => '137'
                                                            },
                                                    '63' => {
                                                              'name' => 'max_v_samp_factor',
                                                              'offset' => '1042',
                                                              'type' => '137'
                                                            },
                                                    '64' => {
                                                              'name' => 'min_DCT_h_scaled_size',
                                                              'offset' => '1046',
                                                              'type' => '137'
                                                            },
                                                    '65' => {
                                                              'name' => 'min_DCT_v_scaled_size',
                                                              'offset' => '1056',
                                                              'type' => '137'
                                                            },
                                                    '66' => {
                                                              'name' => 'total_iMCU_rows',
                                                              'offset' => '1060',
                                                              'type' => '132934'
                                                            },
                                                    '67' => {
                                                              'name' => 'sample_range_limit',
                                                              'offset' => '1074',
                                                              'type' => '133319'
                                                            },
                                                    '68' => {
                                                              'name' => 'comps_in_scan',
                                                              'offset' => '1088',
                                                              'type' => '137'
                                                            },
                                                    '69' => {
                                                              'name' => 'cur_comp_info',
                                                              'offset' => '1096',
                                                              'type' => '137643'
                                                            },
                                                    '7' => {
                                                             'name' => 'image_width',
                                                             'offset' => '72',
                                                             'type' => '132934'
                                                           },
                                                    '70' => {
                                                              'name' => 'MCUs_per_row',
                                                              'offset' => '1152',
                                                              'type' => '132934'
                                                            },
                                                    '71' => {
                                                              'name' => 'MCU_rows_in_scan',
                                                              'offset' => '1156',
                                                              'type' => '132934'
                                                            },
                                                    '72' => {
                                                              'name' => 'blocks_in_MCU',
                                                              'offset' => '1160',
                                                              'type' => '137'
                                                            },
                                                    '73' => {
                                                              'name' => 'MCU_membership',
                                                              'offset' => '1170',
                                                              'type' => '137659'
                                                            },
                                                    '74' => {
                                                              'name' => 'Ss',
                                                              'offset' => '1330',
                                                              'type' => '137'
                                                            },
                                                    '75' => {
                                                              'name' => 'Se',
                                                              'offset' => '1334',
                                                              'type' => '137'
                                                            },
                                                    '76' => {
                                                              'name' => 'Ah',
                                                              'offset' => '1344',
                                                              'type' => '137'
                                                            },
                                                    '77' => {
                                                              'name' => 'Al',
                                                              'offset' => '1348',
                                                              'type' => '137'
                                                            },
                                                    '78' => {
                                                              'name' => 'block_size',
                                                              'offset' => '1352',
                                                              'type' => '137'
                                                            },
                                                    '79' => {
                                                              'name' => 'natural_order',
                                                              'offset' => '1362',
                                                              'type' => '132847'
                                                            },
                                                    '8' => {
                                                             'name' => 'image_height',
                                                             'offset' => '82',
                                                             'type' => '132934'
                                                           },
                                                    '80' => {
                                                              'name' => 'lim_Se',
                                                              'offset' => '1376',
                                                              'type' => '137'
                                                            },
                                                    '81' => {
                                                              'name' => 'unread_marker',
                                                              'offset' => '1380',
                                                              'type' => '137'
                                                            },
                                                    '82' => {
                                                              'name' => 'master',
                                                              'offset' => '1384',
                                                              'type' => '137926'
                                                            },
                                                    '83' => {
                                                              'name' => 'main',
                                                              'offset' => '1398',
                                                              'type' => '137937'
                                                            },
                                                    '84' => {
                                                              'name' => 'coef',
                                                              'offset' => '1412',
                                                              'type' => '137948'
                                                            },
                                                    '85' => {
                                                              'name' => 'post',
                                                              'offset' => '1426',
                                                              'type' => '137959'
                                                            },
                                                    '86' => {
                                                              'name' => 'inputctl',
                                                              'offset' => '1536',
                                                              'type' => '137970'
                                                            },
                                                    '87' => {
                                                              'name' => 'marker',
                                                              'offset' => '1544',
                                                              'type' => '137981'
                                                            },
                                                    '88' => {
                                                              'name' => 'entropy',
                                                              'offset' => '1558',
                                                              'type' => '137992'
                                                            },
                                                    '89' => {
                                                              'name' => 'idct',
                                                              'offset' => '1572',
                                                              'type' => '138003'
                                                            },
                                                    '9' => {
                                                             'name' => 'num_components',
                                                             'offset' => '86',
                                                             'type' => '137'
                                                           },
                                                    '90' => {
                                                              'name' => 'upsample',
                                                              'offset' => '1586',
                                                              'type' => '138014'
                                                            },
                                                    '91' => {
                                                              'name' => 'cconvert',
                                                              'offset' => '1600',
                                                              'type' => '138025'
                                                            },
                                                    '92' => {
                                                              'name' => 'cquantize',
                                                              'offset' => '1608',
                                                              'type' => '138036'
                                                            }
                                                  },
                                        'Name' => 'struct jpeg_decompress_struct',
                                        'PrivateABI' => 1,
                                        'Size' => '656',
                                        'Type' => 'Struct'
                                      },
                          '137' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '137577' => {
                                        'BaseType' => '133868',
                                        'Name' => 'jpeg_component_info*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137583' => {
                                        'BaseType' => '133862',
                                        'Name' => 'JQUANT_TBL*[4]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '137599' => {
                                        'BaseType' => '137615',
                                        'Name' => 'JHUFF_TBL*[4]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '137615' => {
                                        'BaseType' => '133554',
                                        'Name' => 'JHUFF_TBL*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137621' => {
                                        'BaseType' => '132910',
                                        'Name' => 'UINT8[16]',
                                        'Size' => '16',
                                        'Type' => 'Array'
                                      },
                          '137643' => {
                                        'BaseType' => '137577',
                                        'Name' => 'jpeg_component_info*[4]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '137659' => {
                                        'BaseType' => '137',
                                        'Name' => 'int[10]',
                                        'Size' => '40',
                                        'Type' => 'Array'
                                      },
                          '137899' => {
                                        'BaseType' => '137',
                                        'Name' => 'int[64]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '137915' => {
                                        'BaseType' => '137899',
                                        'Name' => 'int[64]*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137921' => {
                                        'Name' => 'struct jpeg_decomp_master',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137926' => {
                                        'BaseType' => '137921',
                                        'Name' => 'struct jpeg_decomp_master*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137932' => {
                                        'Name' => 'struct jpeg_d_main_controller',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137937' => {
                                        'BaseType' => '137932',
                                        'Name' => 'struct jpeg_d_main_controller*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137943' => {
                                        'Name' => 'struct jpeg_d_coef_controller',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137948' => {
                                        'BaseType' => '137943',
                                        'Name' => 'struct jpeg_d_coef_controller*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137954' => {
                                        'Name' => 'struct jpeg_d_post_controller',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137959' => {
                                        'BaseType' => '137954',
                                        'Name' => 'struct jpeg_d_post_controller*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137965' => {
                                        'Name' => 'struct jpeg_input_controller',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137970' => {
                                        'BaseType' => '137965',
                                        'Name' => 'struct jpeg_input_controller*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137976' => {
                                        'Name' => 'struct jpeg_marker_reader',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137981' => {
                                        'BaseType' => '137976',
                                        'Name' => 'struct jpeg_marker_reader*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137987' => {
                                        'Name' => 'struct jpeg_entropy_decoder',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '137992' => {
                                        'BaseType' => '137987',
                                        'Name' => 'struct jpeg_entropy_decoder*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '137998' => {
                                        'Name' => 'struct jpeg_inverse_dct',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138003' => {
                                        'BaseType' => '137998',
                                        'Name' => 'struct jpeg_inverse_dct*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138009' => {
                                        'Name' => 'struct jpeg_upsampler',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138014' => {
                                        'BaseType' => '138009',
                                        'Name' => 'struct jpeg_upsampler*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138020' => {
                                        'Name' => 'struct jpeg_color_deconverter',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138025' => {
                                        'BaseType' => '138020',
                                        'Name' => 'struct jpeg_color_deconverter*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138031' => {
                                        'Name' => 'struct jpeg_color_quantizer',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138036' => {
                                        'BaseType' => '138031',
                                        'Name' => 'struct jpeg_color_quantizer*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138042' => {
                                        'Header' => 'jpeglib.h',
                                        'Line' => '738',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'i',
                                                             'offset' => '0',
                                                             'type' => '138075'
                                                           },
                                                    '1' => {
                                                             'name' => 's',
                                                             'offset' => '0',
                                                             'type' => '138091'
                                                           }
                                                  },
                                        'Name' => 'anon-union-jpeglib.h-738',
                                        'PrivateABI' => 1,
                                        'Size' => '80',
                                        'Type' => 'Union'
                                      },
                          '138075' => {
                                        'BaseType' => '137',
                                        'Name' => 'int[8]',
                                        'Size' => '32',
                                        'Type' => 'Array'
                                      },
                          '138091' => {
                                        'BaseType' => '217',
                                        'Name' => 'char[80]',
                                        'Size' => '80',
                                        'Type' => 'Array'
                                      },
                          '138118' => {
                                        'Name' => 'void(*)(j_common_ptr)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138140' => {
                                        'Name' => 'void(*)(j_common_ptr, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138162' => {
                                        'Name' => 'void(*)(j_common_ptr, char*)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '211'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138168' => {
                                        'BaseType' => '132859',
                                        'Name' => 'char const*const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138212' => {
                                        'BaseType' => '132905',
                                        'Name' => 'JOCTET const*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138229' => {
                                        'Name' => 'void(*)(j_decompress_ptr)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '136095'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138250' => {
                                        'Name' => 'boolean(*)(j_decompress_ptr)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '136095'
                                                            }
                                                   },
                                        'Return' => '132946',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138272' => {
                                        'Name' => 'void(*)(j_decompress_ptr, long)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '136095'
                                                            },
                                                     '1' => {
                                                              'type' => '156'
                                                            }
                                                   },
                                        'Return' => '1',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138298' => {
                                        'Name' => 'boolean(*)(j_decompress_ptr, int)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '136095'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            }
                                                   },
                                        'Return' => '132946',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138304' => {
                                        'BaseType' => '138317',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '829',
                                        'Name' => 'jvirt_sarray_ptr',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '138317' => {
                                        'BaseType' => '138323',
                                        'Name' => 'struct jvirt_sarray_control*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138323' => {
                                        'Name' => 'struct jvirt_sarray_control',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138328' => {
                                        'BaseType' => '138341',
                                        'Header' => 'jpeglib.h',
                                        'Line' => '830',
                                        'Name' => 'jvirt_barray_ptr',
                                        'PrivateABI' => 1,
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '138341' => {
                                        'BaseType' => '138347',
                                        'Name' => 'struct jvirt_barray_control*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '138347' => {
                                        'Name' => 'struct jvirt_barray_control',
                                        'PrivateABI' => 1,
                                        'Type' => 'Struct'
                                      },
                          '138377' => {
                                        'Name' => 'void*(*)(j_common_ptr, int, size_t)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            },
                                                     '2' => {
                                                              'type' => '45'
                                                            }
                                                   },
                                        'Return' => '71',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138413' => {
                                        'Name' => 'JSAMPARRAY(*)(j_common_ptr, int, JDIMENSION, JDIMENSION)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            },
                                                     '2' => {
                                                              'type' => '132934'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            }
                                                   },
                                        'Return' => '133325',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138449' => {
                                        'Name' => 'JBLOCKARRAY(*)(j_common_ptr, int, JDIMENSION, JDIMENSION)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            },
                                                     '2' => {
                                                              'type' => '132934'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            }
                                                   },
                                        'Return' => '133389',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138495' => {
                                        'Name' => 'jvirt_sarray_ptr(*)(j_common_ptr, int, boolean, JDIMENSION, JDIMENSION, JDIMENSION)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            },
                                                     '2' => {
                                                              'type' => '132946'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            },
                                                     '4' => {
                                                              'type' => '132934'
                                                            },
                                                     '5' => {
                                                              'type' => '132934'
                                                            }
                                                   },
                                        'Return' => '138304',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138541' => {
                                        'Name' => 'jvirt_barray_ptr(*)(j_common_ptr, int, boolean, JDIMENSION, JDIMENSION, JDIMENSION)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '137'
                                                            },
                                                     '2' => {
                                                              'type' => '132946'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            },
                                                     '4' => {
                                                              'type' => '132934'
                                                            },
                                                     '5' => {
                                                              'type' => '132934'
                                                            }
                                                   },
                                        'Return' => '138328',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138582' => {
                                        'Name' => 'JSAMPARRAY(*)(j_common_ptr, jvirt_sarray_ptr, JDIMENSION, JDIMENSION, boolean)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '138304'
                                                            },
                                                     '2' => {
                                                              'type' => '132934'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            },
                                                     '4' => {
                                                              'type' => '132946'
                                                            }
                                                   },
                                        'Return' => '133325',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '138623' => {
                                        'Name' => 'JBLOCKARRAY(*)(j_common_ptr, jvirt_barray_ptr, JDIMENSION, JDIMENSION, boolean)',
                                        'Param' => {
                                                     '0' => {
                                                              'type' => '134931'
                                                            },
                                                     '1' => {
                                                              'type' => '138328'
                                                            },
                                                     '2' => {
                                                              'type' => '132934'
                                                            },
                                                     '3' => {
                                                              'type' => '132934'
                                                            },
                                                     '4' => {
                                                              'type' => '132946'
                                                            }
                                                   },
                                        'Return' => '133389',
                                        'Size' => '8',
                                        'Type' => 'FuncPtr'
                                      },
                          '1424' => {
                                      'BaseType' => '1125',
                                      'Name' => 'Bytef*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1430' => {
                                      'Name' => 'struct internal_state',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '1435' => {
                                      'BaseType' => '1430',
                                      'Name' => 'struct internal_state*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '144' => {
                                     'BaseType' => '64',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '1441' => {
                                      'BaseType' => '1228',
                                      'Header' => 'zlib.h',
                                      'Line' => '106',
                                      'Name' => 'z_stream',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Typedef'
                                    },
                          '14492' => {
                                       'BaseType' => '1074',
                                       'Name' => 'uint32_t const',
                                       'Size' => '4',
                                       'Type' => 'Const'
                                     },
                          '1453' => {
                                      'BaseType' => '730',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '108',
                                      'Name' => 'rfbBool',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '14998' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '152',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'x',
                                                            'offset' => '0',
                                                            'type' => '1062'
                                                          },
                                                   '1' => {
                                                            'name' => 'y',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '2' => {
                                                            'name' => 'w',
                                                            'offset' => '4',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'h',
                                                            'offset' => '6',
                                                            'type' => '1062'
                                                          }
                                                 },
                                       'Name' => 'struct rfbRectangle',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15388' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '562',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'nRects',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          }
                                                 },
                                       'Name' => 'struct rfbFramebufferUpdateMsg',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '15438' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '577',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'r',
                                                            'offset' => '0',
                                                            'type' => '14998'
                                                          },
                                                   '1' => {
                                                            'name' => 'encoding',
                                                            'offset' => '8',
                                                            'type' => '1074'
                                                          }
                                                 },
                                       'Name' => 'struct rfbFramebufferUpdateRectHeader',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '156' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '15752' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '987',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'firstColour',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'nColours',
                                                            'offset' => '4',
                                                            'type' => '1062'
                                                          }
                                                 },
                                       'Name' => 'struct rfbSetColourMapEntriesMsg',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '15790' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '999',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          }
                                                 },
                                       'Name' => 'struct rfbBellMsg',
                                       'Size' => '1',
                                       'Type' => 'Struct'
                                     },
                          '15870' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1015',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad1',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'pad2',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '1074'
                                                          }
                                                 },
                                       'Name' => 'struct rfbServerCutTextMsg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '15883' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1026',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'contentType',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'contentParam',
                                                            'offset' => '2',
                                                            'type' => '1045'
                                                          },
                                                   '3' => {
                                                            'name' => 'pad',
                                                            'offset' => '3',
                                                            'type' => '1045'
                                                          },
                                                   '4' => {
                                                            'name' => 'size',
                                                            'offset' => '4',
                                                            'type' => '1074'
                                                          },
                                                   '5' => {
                                                            'name' => 'length',
                                                            'offset' => '8',
                                                            'type' => '1074'
                                                          }
                                                 },
                                       'Name' => 'struct _rfbFileTransferMsg',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '15982' => {
                                       'BaseType' => '15883',
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1035',
                                       'Name' => 'rfbFileTransferMsg',
                                       'Size' => '12',
                                       'Type' => 'Typedef'
                                     },
                          '15995' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1102',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad1',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'pad2',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'length',
                                                            'offset' => '4',
                                                            'type' => '1074'
                                                          }
                                                 },
                                       'Name' => 'struct _rfbTextChatMsg',
                                       'Size' => '8',
                                       'Type' => 'Struct'
                                     },
                          '16066' => {
                                       'BaseType' => '15995',
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1108',
                                       'Name' => 'rfbTextChatMsg',
                                       'Size' => '8',
                                       'Type' => 'Typedef'
                                     },
                          '16146' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1144',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'version',
                                                            'offset' => '2',
                                                            'type' => '1045'
                                                          },
                                                   '3' => {
                                                            'name' => 'code',
                                                            'offset' => '3',
                                                            'type' => '1045'
                                                          }
                                                 },
                                       'Name' => 'struct rfbXvpMsg',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16159' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1164',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'numberOfScreens',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad',
                                                            'offset' => '1',
                                                            'type' => '16202'
                                                          }
                                                 },
                                       'Name' => 'struct rfbExtDesktopSizeMsg',
                                       'Size' => '4',
                                       'Type' => 'Struct'
                                     },
                          '16202' => {
                                       'BaseType' => '1045',
                                       'Name' => 'uint8_t[3]',
                                       'Size' => '3',
                                       'Type' => 'Array'
                                     },
                          '16218' => {
                                       'BaseType' => '16159',
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1169',
                                       'Name' => 'rfbExtDesktopSizeMsg',
                                       'Size' => '4',
                                       'Type' => 'Typedef'
                                     },
                          '163' => {
                                     'BaseType' => '156',
                                     'Header' => 'types.h',
                                     'Line' => '152',
                                     'Name' => '__off_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1631' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '207',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bitsPerPixel',
                                                           'offset' => '0',
                                                           'type' => '1045'
                                                         },
                                                  '1' => {
                                                           'name' => 'depth',
                                                           'offset' => '1',
                                                           'type' => '1045'
                                                         },
                                                  '10' => {
                                                            'name' => 'pad1',
                                                            'offset' => '19',
                                                            'type' => '1045'
                                                          },
                                                  '11' => {
                                                            'name' => 'pad2',
                                                            'offset' => '20',
                                                            'type' => '1062'
                                                          },
                                                  '2' => {
                                                           'name' => 'bigEndian',
                                                           'offset' => '2',
                                                           'type' => '1045'
                                                         },
                                                  '3' => {
                                                           'name' => 'trueColour',
                                                           'offset' => '3',
                                                           'type' => '1045'
                                                         },
                                                  '4' => {
                                                           'name' => 'redMax',
                                                           'offset' => '4',
                                                           'type' => '1062'
                                                         },
                                                  '5' => {
                                                           'name' => 'greenMax',
                                                           'offset' => '6',
                                                           'type' => '1062'
                                                         },
                                                  '6' => {
                                                           'name' => 'blueMax',
                                                           'offset' => '8',
                                                           'type' => '1062'
                                                         },
                                                  '7' => {
                                                           'name' => 'redShift',
                                                           'offset' => '16',
                                                           'type' => '1045'
                                                         },
                                                  '8' => {
                                                           'name' => 'greenShift',
                                                           'offset' => '17',
                                                           'type' => '1045'
                                                         },
                                                  '9' => {
                                                           'name' => 'blueShift',
                                                           'offset' => '18',
                                                           'type' => '1045'
                                                         }
                                                },
                                      'Name' => 'struct rfbPixelFormat',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '16450' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1220',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad1',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'framebufferWidth',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'framebufferHeigth',
                                                            'offset' => '4',
                                                            'type' => '1062'
                                                          }
                                                 },
                                       'Name' => 'struct _rfbResizeFrameBufferMsg',
                                       'Size' => '6',
                                       'Type' => 'Struct'
                                     },
                          '16521' => {
                                       'BaseType' => '16450',
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1225',
                                       'Name' => 'rfbResizeFrameBufferMsg',
                                       'Size' => '6',
                                       'Type' => 'Typedef'
                                     },
                          '16643' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1247',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'pad1',
                                                            'offset' => '1',
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'name' => 'desktop_w',
                                                            'offset' => '2',
                                                            'type' => '1062'
                                                          },
                                                   '3' => {
                                                            'name' => 'desktop_h',
                                                            'offset' => '4',
                                                            'type' => '1062'
                                                          },
                                                   '4' => {
                                                            'name' => 'buffer_w',
                                                            'offset' => '6',
                                                            'type' => '1062'
                                                          },
                                                   '5' => {
                                                            'name' => 'buffer_h',
                                                            'offset' => '8',
                                                            'type' => '1062'
                                                          },
                                                   '6' => {
                                                            'name' => 'pad2',
                                                            'offset' => '16',
                                                            'type' => '1062'
                                                          }
                                                 },
                                       'Name' => 'struct rfbPalmVNCReSizeFrameBufferMsg',
                                       'Size' => '12',
                                       'Type' => 'Struct'
                                     },
                          '16805' => {
                                       'Header' => 'rfbproto.h',
                                       'Line' => '1270',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1045'
                                                          },
                                                   '1' => {
                                                            'name' => 'fu',
                                                            'offset' => '0',
                                                            'type' => '15388'
                                                          },
                                                   '10' => {
                                                             'name' => 'eds',
                                                             'offset' => '0',
                                                             'type' => '16218'
                                                           },
                                                   '2' => {
                                                            'name' => 'scme',
                                                            'offset' => '0',
                                                            'type' => '15752'
                                                          },
                                                   '3' => {
                                                            'name' => 'b',
                                                            'offset' => '0',
                                                            'type' => '15790'
                                                          },
                                                   '4' => {
                                                            'name' => 'sct',
                                                            'offset' => '0',
                                                            'type' => '15870'
                                                          },
                                                   '5' => {
                                                            'name' => 'rsfb',
                                                            'offset' => '0',
                                                            'type' => '16521'
                                                          },
                                                   '6' => {
                                                            'name' => 'prsfb',
                                                            'offset' => '0',
                                                            'type' => '16643'
                                                          },
                                                   '7' => {
                                                            'name' => 'ft',
                                                            'offset' => '0',
                                                            'type' => '15982'
                                                          },
                                                   '8' => {
                                                            'name' => 'tc',
                                                            'offset' => '0',
                                                            'type' => '16066'
                                                          },
                                                   '9' => {
                                                            'name' => 'xvp',
                                                            'offset' => '0',
                                                            'type' => '16146'
                                                          }
                                                 },
                                       'Name' => 'union rfbServerToClientMsg',
                                       'Size' => '12',
                                       'Type' => 'Union'
                                     },
                          '1710' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '376',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'framebufferWidth',
                                                           'offset' => '0',
                                                           'type' => '1062'
                                                         },
                                                  '1' => {
                                                           'name' => 'framebufferHeight',
                                                           'offset' => '2',
                                                           'type' => '1062'
                                                         },
                                                  '2' => {
                                                           'name' => 'format',
                                                           'offset' => '4',
                                                           'type' => '1631'
                                                         },
                                                  '3' => {
                                                           'name' => 'nameLength',
                                                           'offset' => '32',
                                                           'type' => '1074'
                                                         }
                                                },
                                      'Name' => 'struct rfbServerInitMsg',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '175' => {
                                     'BaseType' => '156',
                                     'Header' => 'types.h',
                                     'Line' => '153',
                                     'Name' => '__off64_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1762' => {
                                      'BaseType' => '1045',
                                      'Name' => 'uint8_t[32]',
                                      'Size' => '32',
                                      'Type' => 'Array'
                                    },
                          '1778' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '591',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'client2server',
                                                           'offset' => '0',
                                                           'type' => '1762'
                                                         },
                                                  '1' => {
                                                           'name' => 'server2client',
                                                           'offset' => '50',
                                                           'type' => '1762'
                                                         }
                                                },
                                      'Name' => 'struct rfbSupportedMessages',
                                      'Size' => '64',
                                      'Type' => 'Struct'
                                    },
                          '187' => {
                                     'BaseType' => '156',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1899' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1171',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'id',
                                                           'offset' => '0',
                                                           'type' => '1074'
                                                         },
                                                  '1' => {
                                                           'name' => 'x',
                                                           'offset' => '4',
                                                           'type' => '1062'
                                                         },
                                                  '2' => {
                                                           'name' => 'y',
                                                           'offset' => '6',
                                                           'type' => '1062'
                                                         },
                                                  '3' => {
                                                           'name' => 'width',
                                                           'offset' => '8',
                                                           'type' => '1062'
                                                         },
                                                  '4' => {
                                                           'name' => 'height',
                                                           'offset' => '16',
                                                           'type' => '1062'
                                                         },
                                                  '5' => {
                                                           'name' => 'flags',
                                                           'offset' => '18',
                                                           'type' => '1074'
                                                         }
                                                },
                                      'Name' => 'struct rfbExtDesktopScreen',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '199' => {
                                     'BaseType' => '156',
                                     'Header' => 'types.h',
                                     'Line' => '162',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '1993' => {
                                      'BaseType' => '1899',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1178',
                                      'Name' => 'rfbExtDesktopScreen',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '2067' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '109',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'file',
                                                           'offset' => '0',
                                                           'type' => '717'
                                                         },
                                                  '1' => {
                                                           'name' => 'tv',
                                                           'offset' => '8',
                                                           'type' => '742'
                                                         },
                                                  '2' => {
                                                           'name' => 'readTimestamp',
                                                           'offset' => '36',
                                                           'type' => '1453'
                                                         },
                                                  '3' => {
                                                           'name' => 'doNotSleep',
                                                           'offset' => '37',
                                                           'type' => '1453'
                                                         }
                                                },
                                      'Name' => 'struct rfbVNCRec',
                                      'Size' => '32',
                                      'Type' => 'Struct'
                                    },
                          '20721' => {
                                       'Header' => 'rfbclient.h',
                                       'Line' => '679',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'encodings',
                                                            'offset' => '0',
                                                            'type' => '10969'
                                                          },
                                                   '1' => {
                                                            'name' => 'handleEncoding',
                                                            'offset' => '8',
                                                            'type' => '20858'
                                                          },
                                                   '2' => {
                                                            'name' => 'handleMessage',
                                                            'offset' => '22',
                                                            'type' => '20890'
                                                          },
                                                   '3' => {
                                                            'name' => 'next',
                                                            'offset' => '36',
                                                            'type' => '20896'
                                                          },
                                                   '4' => {
                                                            'name' => 'securityTypes',
                                                            'offset' => '50',
                                                            'type' => '20902'
                                                          },
                                                   '5' => {
                                                            'name' => 'handleAuthentication',
                                                            'offset' => '64',
                                                            'type' => '20928'
                                                          }
                                                 },
                                       'Name' => 'struct _rfbClientProtocolExtension',
                                       'Size' => '48',
                                       'Type' => 'Struct'
                                     },
                          '2079' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '113',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'tag',
                                                           'offset' => '0',
                                                           'type' => '71'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '71'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '22',
                                                           'type' => '2132'
                                                         }
                                                },
                                      'Name' => 'struct rfbClientData',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '20852' => {
                                       'BaseType' => '15438',
                                       'Name' => 'rfbFramebufferUpdateRectHeader*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20858' => {
                                       'Name' => 'rfbBool(*)(rfbClient*, rfbFramebufferUpdateRectHeader*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4962'
                                                           },
                                                    '1' => {
                                                             'type' => '20852'
                                                           }
                                                  },
                                       'Return' => '1453',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '20884' => {
                                       'BaseType' => '16805',
                                       'Name' => 'rfbServerToClientMsg*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20890' => {
                                       'Name' => 'rfbBool(*)(rfbClient*, rfbServerToClientMsg*)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4962'
                                                           },
                                                    '1' => {
                                                             'type' => '20884'
                                                           }
                                                  },
                                       'Return' => '1453',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '20896' => {
                                       'BaseType' => '20721',
                                       'Name' => 'struct _rfbClientProtocolExtension*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20902' => {
                                       'BaseType' => '14492',
                                       'Name' => 'uint32_t const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '20928' => {
                                       'Name' => 'rfbBool(*)(rfbClient*, uint32_t)',
                                       'Param' => {
                                                    '0' => {
                                                             'type' => '4962'
                                                           },
                                                    '1' => {
                                                             'type' => '1074'
                                                           }
                                                  },
                                       'Return' => '1453',
                                       'Size' => '8',
                                       'Type' => 'FuncPtr'
                                     },
                          '20934' => {
                                       'BaseType' => '20721',
                                       'Header' => 'rfbclient.h',
                                       'Line' => '691',
                                       'Name' => 'rfbClientProtocolExtension',
                                       'Size' => '48',
                                       'Type' => 'Typedef'
                                     },
                          '21060' => {
                                       'BaseType' => '20934',
                                       'Name' => 'rfbClientProtocolExtension*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '211' => {
                                     'BaseType' => '217',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '2132' => {
                                      'BaseType' => '2079',
                                      'Name' => 'struct rfbClientData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2138' => {
                                      'BaseType' => '2079',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '117',
                                      'Name' => 'rfbClientData',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '21490' => {
                                       'Name' => 'double',
                                       'Size' => '8',
                                       'Type' => 'Intrinsic'
                                     },
                          '217' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '224' => {
                                     'BaseType' => '217',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '229' => {
                                     'Header' => 'struct_FILE.h',
                                     'Line' => '49',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '_flags',
                                                          'offset' => '0',
                                                          'type' => '137'
                                                        },
                                                 '1' => {
                                                          'name' => '_IO_read_ptr',
                                                          'offset' => '8',
                                                          'type' => '211'
                                                        },
                                                 '10' => {
                                                           'name' => '_IO_backup_base',
                                                           'offset' => '128',
                                                           'type' => '211'
                                                         },
                                                 '11' => {
                                                           'name' => '_IO_save_end',
                                                           'offset' => '136',
                                                           'type' => '211'
                                                         },
                                                 '12' => {
                                                           'name' => '_markers',
                                                           'offset' => '150',
                                                           'type' => '645'
                                                         },
                                                 '13' => {
                                                           'name' => '_chain',
                                                           'offset' => '260',
                                                           'type' => '651'
                                                         },
                                                 '14' => {
                                                           'name' => '_fileno',
                                                           'offset' => '274',
                                                           'type' => '137'
                                                         },
                                                 '15' => {
                                                           'name' => '_flags2',
                                                           'offset' => '278',
                                                           'type' => '137'
                                                         },
                                                 '16' => {
                                                           'name' => '_old_offset',
                                                           'offset' => '288',
                                                           'type' => '163'
                                                         },
                                                 '17' => {
                                                           'name' => '_cur_column',
                                                           'offset' => '296',
                                                           'type' => '80'
                                                         },
                                                 '18' => {
                                                           'name' => '_vtable_offset',
                                                           'offset' => '304',
                                                           'type' => '99'
                                                         },
                                                 '19' => {
                                                           'name' => '_shortbuf',
                                                           'offset' => '305',
                                                           'type' => '657'
                                                         },
                                                 '2' => {
                                                          'name' => '_IO_read_end',
                                                          'offset' => '22',
                                                          'type' => '211'
                                                        },
                                                 '20' => {
                                                           'name' => '_lock',
                                                           'offset' => '310',
                                                           'type' => '673'
                                                         },
                                                 '21' => {
                                                           'name' => '_offset',
                                                           'offset' => '324',
                                                           'type' => '175'
                                                         },
                                                 '22' => {
                                                           'name' => '_codecvt',
                                                           'offset' => '338',
                                                           'type' => '684'
                                                         },
                                                 '23' => {
                                                           'name' => '_wide_data',
                                                           'offset' => '352',
                                                           'type' => '695'
                                                         },
                                                 '24' => {
                                                           'name' => '_freeres_list',
                                                           'offset' => '360',
                                                           'type' => '651'
                                                         },
                                                 '25' => {
                                                           'name' => '_freeres_buf',
                                                           'offset' => '374',
                                                           'type' => '71'
                                                         },
                                                 '26' => {
                                                           'name' => '__pad5',
                                                           'offset' => '388',
                                                           'type' => '45'
                                                         },
                                                 '27' => {
                                                           'name' => '_mode',
                                                           'offset' => '402',
                                                           'type' => '137'
                                                         },
                                                 '28' => {
                                                           'name' => '_unused2',
                                                           'offset' => '406',
                                                           'type' => '701'
                                                         },
                                                 '3' => {
                                                          'name' => '_IO_read_base',
                                                          'offset' => '36',
                                                          'type' => '211'
                                                        },
                                                 '4' => {
                                                          'name' => '_IO_write_base',
                                                          'offset' => '50',
                                                          'type' => '211'
                                                        },
                                                 '5' => {
                                                          'name' => '_IO_write_ptr',
                                                          'offset' => '64',
                                                          'type' => '211'
                                                        },
                                                 '6' => {
                                                          'name' => '_IO_write_end',
                                                          'offset' => '72',
                                                          'type' => '211'
                                                        },
                                                 '7' => {
                                                          'name' => '_IO_buf_base',
                                                          'offset' => '86',
                                                          'type' => '211'
                                                        },
                                                 '8' => {
                                                          'name' => '_IO_buf_end',
                                                          'offset' => '100',
                                                          'type' => '211'
                                                        },
                                                 '9' => {
                                                          'name' => '_IO_save_base',
                                                          'offset' => '114',
                                                          'type' => '211'
                                                        }
                                               },
                                     'Name' => 'struct _IO_FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Struct'
                                   },
                          '2342' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '139',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'shareDesktop',
                                                           'offset' => '0',
                                                           'type' => '1453'
                                                         },
                                                  '1' => {
                                                           'name' => 'viewOnly',
                                                           'offset' => '1',
                                                           'type' => '1453'
                                                         },
                                                  '10' => {
                                                            'name' => 'enableJPEG',
                                                            'offset' => '64',
                                                            'type' => '1453'
                                                          },
                                                  '11' => {
                                                            'name' => 'useRemoteCursor',
                                                            'offset' => '65',
                                                            'type' => '1453'
                                                          },
                                                  '12' => {
                                                            'name' => 'palmVNC',
                                                            'offset' => '66',
                                                            'type' => '1453'
                                                          },
                                                  '13' => {
                                                            'name' => 'scaleSetting',
                                                            'offset' => '68',
                                                            'type' => '137'
                                                          },
                                                  '2' => {
                                                           'name' => 'encodingsString',
                                                           'offset' => '8',
                                                           'type' => '1039'
                                                         },
                                                  '3' => {
                                                           'name' => 'useBGR233',
                                                           'offset' => '22',
                                                           'type' => '1453'
                                                         },
                                                  '4' => {
                                                           'name' => 'nColours',
                                                           'offset' => '32',
                                                           'type' => '137'
                                                         },
                                                  '5' => {
                                                           'name' => 'forceOwnCmap',
                                                           'offset' => '36',
                                                           'type' => '1453'
                                                         },
                                                  '6' => {
                                                           'name' => 'forceTrueColour',
                                                           'offset' => '37',
                                                           'type' => '1453'
                                                         },
                                                  '7' => {
                                                           'name' => 'requestedDepth',
                                                           'offset' => '40',
                                                           'type' => '137'
                                                         },
                                                  '8' => {
                                                           'name' => 'compressLevel',
                                                           'offset' => '50',
                                                           'type' => '137'
                                                         },
                                                  '9' => {
                                                           'name' => 'qualityLevel',
                                                           'offset' => '54',
                                                           'type' => '137'
                                                         }
                                                },
                                      'Name' => 'struct AppData',
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '2354' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '145',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x509CACertFile',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'x509CACrlFile',
                                                           'offset' => '8',
                                                           'type' => '211'
                                                         },
                                                  '2' => {
                                                           'name' => 'x509ClientCertFile',
                                                           'offset' => '22',
                                                           'type' => '211'
                                                         },
                                                  '3' => {
                                                           'name' => 'x509ClientKeyFile',
                                                           'offset' => '36',
                                                           'type' => '211'
                                                         },
                                                  '4' => {
                                                           'name' => 'x509CrlVerifyMode',
                                                           'offset' => '50',
                                                           'type' => '1045'
                                                         }
                                                },
                                      'Name' => 'anon-struct-rfbclient.h-145',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '23594' => {
                                       'BaseType' => '1631',
                                       'Name' => 'rfbPixelFormat*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '2429' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '154',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'username',
                                                           'offset' => '0',
                                                           'type' => '211'
                                                         },
                                                  '1' => {
                                                           'name' => 'password',
                                                           'offset' => '8',
                                                           'type' => '211'
                                                         }
                                                },
                                      'Name' => 'anon-struct-rfbclient.h-154',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2465' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '142',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x509Credential',
                                                           'offset' => '0',
                                                           'type' => '2354'
                                                         },
                                                  '1' => {
                                                           'name' => 'userCredential',
                                                           'offset' => '0',
                                                           'type' => '2429'
                                                         }
                                                },
                                      'Name' => 'union _rfbCredential',
                                      'Size' => '40',
                                      'Type' => 'Union'
                                    },
                          '2503' => {
                                      'BaseType' => '2465',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '159',
                                      'Name' => 'rfbCredential',
                                      'Size' => '40',
                                      'Type' => 'Typedef'
                                    },
                          '2515' => {
                                      'BaseType' => '2527',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '183',
                                      'Name' => 'HandleTextChatProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '2527' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, char*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '211'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2554' => {
                                      'BaseType' => '2560',
                                      'Name' => 'struct _rfbClient*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2560' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '241',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'frameBuffer',
                                                           'offset' => '0',
                                                           'type' => '4795'
                                                         },
                                                  '1' => {
                                                           'name' => 'width',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         },
                                                  '10' => {
                                                            'name' => 'flashPort',
                                                            'offset' => '256',
                                                            'type' => '137'
                                                          },
                                                  '11' => {
                                                            'name' => 'updateRect',
                                                            'offset' => '260',
                                                            'type' => '4737'
                                                          },
                                                  '12' => {
                                                            'name' => 'buffer',
                                                            'offset' => '288',
                                                            'type' => '4801'
                                                          },
                                                  '13' => {
                                                            'name' => 'sock',
                                                            'offset' => '3175200',
                                                            'type' => '137'
                                                          },
                                                  '14' => {
                                                            'name' => 'canUseCoRRE',
                                                            'offset' => '3175204',
                                                            'type' => '1453'
                                                          },
                                                  '15' => {
                                                            'name' => 'canUseHextile',
                                                            'offset' => '3175205',
                                                            'type' => '1453'
                                                          },
                                                  '16' => {
                                                            'name' => 'desktopName',
                                                            'offset' => '3175208',
                                                            'type' => '211'
                                                          },
                                                  '17' => {
                                                            'name' => 'format',
                                                            'offset' => '3175222',
                                                            'type' => '1631'
                                                          },
                                                  '18' => {
                                                            'name' => 'si',
                                                            'offset' => '3175250',
                                                            'type' => '1710'
                                                          },
                                                  '19' => {
                                                            'name' => 'buf',
                                                            'offset' => '3175286',
                                                            'type' => '4820'
                                                          },
                                                  '2' => {
                                                           'name' => 'height',
                                                           'offset' => '18',
                                                           'type' => '137'
                                                         },
                                                  '20' => {
                                                            'name' => 'bufoutptr',
                                                            'offset' => '3233128',
                                                            'type' => '211'
                                                          },
                                                  '21' => {
                                                            'name' => 'buffered',
                                                            'offset' => '3233142',
                                                            'type' => '64'
                                                          },
                                                  '22' => {
                                                            'name' => 'ultra_buffer_size',
                                                            'offset' => '3233152',
                                                            'type' => '137'
                                                          },
                                                  '23' => {
                                                            'name' => 'ultra_buffer',
                                                            'offset' => '3233156',
                                                            'type' => '211'
                                                          },
                                                  '24' => {
                                                            'name' => 'raw_buffer_size',
                                                            'offset' => '3233170',
                                                            'type' => '137'
                                                          },
                                                  '25' => {
                                                            'name' => 'raw_buffer',
                                                            'offset' => '3233280',
                                                            'type' => '211'
                                                          },
                                                  '26' => {
                                                            'name' => 'decompStream',
                                                            'offset' => '3233288',
                                                            'type' => '1441'
                                                          },
                                                  '27' => {
                                                            'name' => 'decompStreamInited',
                                                            'offset' => '3233568',
                                                            'type' => '1453'
                                                          },
                                                  '28' => {
                                                            'name' => 'zlib_buffer',
                                                            'offset' => '3233569',
                                                            'type' => '4837'
                                                          },
                                                  '29' => {
                                                            'name' => 'zlibStream',
                                                            'offset' => '3430184',
                                                            'type' => '4854'
                                                          },
                                                  '3' => {
                                                           'name' => 'endianTest',
                                                           'offset' => '22',
                                                           'type' => '137'
                                                         },
                                                  '30' => {
                                                            'name' => 'zlibStreamActive',
                                                            'offset' => '3432822',
                                                            'type' => '4870'
                                                          },
                                                  '31' => {
                                                            'name' => 'cutZeros',
                                                            'offset' => '3432832',
                                                            'type' => '1453'
                                                          },
                                                  '32' => {
                                                            'name' => 'rectWidth',
                                                            'offset' => '3432836',
                                                            'type' => '137'
                                                          },
                                                  '33' => {
                                                            'name' => 'rectColors',
                                                            'offset' => '3432840',
                                                            'type' => '137'
                                                          },
                                                  '34' => {
                                                            'name' => 'tightPalette',
                                                            'offset' => '3432850',
                                                            'type' => '4886'
                                                          },
                                                  '35' => {
                                                            'name' => 'tightPrevRow',
                                                            'offset' => '3437078',
                                                            'type' => '4903'
                                                          },
                                                  '36' => {
                                                            'name' => 'jpegError',
                                                            'offset' => '3511556',
                                                            'type' => '1453'
                                                          },
                                                  '37' => {
                                                            'name' => 'jpegSrcManager',
                                                            'offset' => '3511570',
                                                            'type' => '4925'
                                                          },
                                                  '38' => {
                                                            'name' => 'jpegBufferPtr',
                                                            'offset' => '3511584',
                                                            'type' => '71'
                                                          },
                                                  '39' => {
                                                            'name' => 'jpegBufferLen',
                                                            'offset' => '3511592',
                                                            'type' => '45'
                                                          },
                                                  '4' => {
                                                           'name' => 'appData',
                                                           'offset' => '36',
                                                           'type' => '2342'
                                                         },
                                                  '40' => {
                                                            'name' => 'rcSource',
                                                            'offset' => '3511606',
                                                            'type' => '4795'
                                                          },
                                                  '41' => {
                                                            'name' => 'rcMask',
                                                            'offset' => '3511620',
                                                            'type' => '4795'
                                                          },
                                                  '42' => {
                                                            'name' => 'clientData',
                                                            'offset' => '3511634',
                                                            'type' => '4931'
                                                          },
                                                  '43' => {
                                                            'name' => 'vncRec',
                                                            'offset' => '3511648',
                                                            'type' => '4937'
                                                          },
                                                  '44' => {
                                                            'name' => 'KeyboardLedStateEnabled',
                                                            'offset' => '3511656',
                                                            'type' => '137'
                                                          },
                                                  '45' => {
                                                            'name' => 'CurrentKeyboardLedState',
                                                            'offset' => '3511666',
                                                            'type' => '137'
                                                          },
                                                  '46' => {
                                                            'name' => 'canHandleNewFBSize',
                                                            'offset' => '3511670',
                                                            'type' => '137'
                                                          },
                                                  '47' => {
                                                            'name' => 'HandleTextChat',
                                                            'offset' => '3511684',
                                                            'type' => '2515'
                                                          },
                                                  '48' => {
                                                            'name' => 'HandleKeyboardLedState',
                                                            'offset' => '3511698',
                                                            'type' => '4078'
                                                          },
                                                  '49' => {
                                                            'name' => 'HandleCursorPos',
                                                            'offset' => '3511808',
                                                            'type' => '4117'
                                                          },
                                                  '5' => {
                                                           'name' => 'programName',
                                                           'offset' => '114',
                                                           'type' => '1039'
                                                         },
                                                  '50' => {
                                                            'name' => 'SoftCursorLockArea',
                                                            'offset' => '3511816',
                                                            'type' => '4160'
                                                          },
                                                  '51' => {
                                                            'name' => 'SoftCursorUnlockScreen',
                                                            'offset' => '3511830',
                                                            'type' => '4209'
                                                          },
                                                  '52' => {
                                                            'name' => 'GotFrameBufferUpdate',
                                                            'offset' => '3511844',
                                                            'type' => '4238'
                                                          },
                                                  '53' => {
                                                            'name' => 'GetPassword',
                                                            'offset' => '3511858',
                                                            'type' => '4262'
                                                          },
                                                  '54' => {
                                                            'name' => 'MallocFrameBuffer',
                                                            'offset' => '3511872',
                                                            'type' => '4339'
                                                          },
                                                  '55' => {
                                                            'name' => 'GotXCutText',
                                                            'offset' => '3511880',
                                                            'type' => '4372'
                                                          },
                                                  '56' => {
                                                            'name' => 'Bell',
                                                            'offset' => '3511894',
                                                            'type' => '4411'
                                                          },
                                                  '57' => {
                                                            'name' => 'GotCursorShape',
                                                            'offset' => '3511908',
                                                            'type' => '4423'
                                                          },
                                                  '58' => {
                                                            'name' => 'GotCopyRect',
                                                            'offset' => '3511922',
                                                            'type' => '4477'
                                                          },
                                                  '59' => {
                                                            'name' => 'supportedMessages',
                                                            'offset' => '3511936',
                                                            'type' => '1778'
                                                          },
                                                  '6' => {
                                                           'name' => 'serverHost',
                                                           'offset' => '128',
                                                           'type' => '211'
                                                         },
                                                  '60' => {
                                                            'name' => 'major',
                                                            'offset' => '3512132',
                                                            'type' => '137'
                                                          },
                                                  '61' => {
                                                            'name' => 'minor',
                                                            'offset' => '3512136',
                                                            'type' => '137'
                                                          },
                                                  '62' => {
                                                            'name' => 'authScheme',
                                                            'offset' => '3512146',
                                                            'type' => '1074'
                                                          },
                                                  '63' => {
                                                            'name' => 'subAuthScheme',
                                                            'offset' => '3512150',
                                                            'type' => '1074'
                                                          },
                                                  '64' => {
                                                            'name' => 'tlsSession',
                                                            'offset' => '3512160',
                                                            'type' => '71'
                                                          },
                                                  '65' => {
                                                            'name' => 'GetCredential',
                                                            'offset' => '3512168',
                                                            'type' => '4295'
                                                          },
                                                  '66' => {
                                                            'name' => 'clientAuthSchemes',
                                                            'offset' => '3512182',
                                                            'type' => '4943'
                                                          },
                                                  '67' => {
                                                            'name' => 'destHost',
                                                            'offset' => '3512196',
                                                            'type' => '211'
                                                          },
                                                  '68' => {
                                                            'name' => 'destPort',
                                                            'offset' => '3512210',
                                                            'type' => '137'
                                                          },
                                                  '69' => {
                                                            'name' => 'QoS_DSCP',
                                                            'offset' => '3512214',
                                                            'type' => '137'
                                                          },
                                                  '7' => {
                                                           'name' => 'serverPort',
                                                           'offset' => '136',
                                                           'type' => '137'
                                                         },
                                                  '70' => {
                                                            'name' => 'HandleXvpMsg',
                                                            'offset' => '3512320',
                                                            'type' => '4039'
                                                          },
                                                  '71' => {
                                                            'name' => 'listenSock',
                                                            'offset' => '3512328',
                                                            'type' => '137'
                                                          },
                                                  '72' => {
                                                            'name' => 'FinishedFrameBufferUpdate',
                                                            'offset' => '3512342',
                                                            'type' => '4250'
                                                          },
                                                  '73' => {
                                                            'name' => 'listenAddress',
                                                            'offset' => '3512356',
                                                            'type' => '211'
                                                          },
                                                  '74' => {
                                                            'name' => 'listen6Sock',
                                                            'offset' => '3512370',
                                                            'type' => '137'
                                                          },
                                                  '75' => {
                                                            'name' => 'listen6Address',
                                                            'offset' => '3512384',
                                                            'type' => '211'
                                                          },
                                                  '76' => {
                                                            'name' => 'listen6Port',
                                                            'offset' => '3512392',
                                                            'type' => '137'
                                                          },
                                                  '77' => {
                                                            'name' => 'outputWindow',
                                                            'offset' => '3512406',
                                                            'type' => '57'
                                                          },
                                                  '78' => {
                                                            'name' => 'LockWriteToTLS',
                                                            'offset' => '3512420',
                                                            'type' => '4713'
                                                          },
                                                  '79' => {
                                                            'name' => 'UnlockWriteToTLS',
                                                            'offset' => '3512434',
                                                            'type' => '4725'
                                                          },
                                                  '8' => {
                                                           'name' => 'listenSpecified',
                                                           'offset' => '146',
                                                           'type' => '1453'
                                                         },
                                                  '80' => {
                                                            'name' => 'GotFillRect',
                                                            'offset' => '3512448',
                                                            'type' => '4536'
                                                          },
                                                  '81' => {
                                                            'name' => 'GotBitmap',
                                                            'offset' => '3512456',
                                                            'type' => '4590'
                                                          },
                                                  '82' => {
                                                            'name' => 'GotJpeg',
                                                            'offset' => '3512470',
                                                            'type' => '4650'
                                                          },
                                                  '83' => {
                                                            'name' => 'tjhnd',
                                                            'offset' => '3512580',
                                                            'type' => '71'
                                                          },
                                                  '84' => {
                                                            'name' => 'connectTimeout',
                                                            'offset' => '3512594',
                                                            'type' => '64'
                                                          },
                                                  '85' => {
                                                            'name' => 'readTimeout',
                                                            'offset' => '3512598',
                                                            'type' => '64'
                                                          },
                                                  '86' => {
                                                            'name' => 'tlsRwMutex',
                                                            'offset' => '3512608',
                                                            'type' => '1027'
                                                          },
                                                  '87' => {
                                                            'name' => 'requestedResize',
                                                            'offset' => '3512672',
                                                            'type' => '1453'
                                                          },
                                                  '88' => {
                                                            'name' => 'screen',
                                                            'offset' => '3512676',
                                                            'type' => '1993'
                                                          },
                                                  '9' => {
                                                           'name' => 'listenPort',
                                                           'offset' => '150',
                                                           'type' => '137'
                                                         }
                                                },
                                      'Name' => 'struct _rfbClient',
                                      'Size' => '359984',
                                      'Type' => 'Struct'
                                    },
                          '4039' => {
                                      'BaseType' => '4051',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '193',
                                      'Name' => 'HandleXvpMsgProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4051' => {
                                      'Name' => 'void(*)(struct _rfbClient*, uint8_t, uint8_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '1045'
                                                          },
                                                   '2' => {
                                                            'type' => '1045'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4078' => {
                                      'BaseType' => '4090',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '194',
                                      'Name' => 'HandleKeyboardLedStateProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4090' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4117' => {
                                      'BaseType' => '4129',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '195',
                                      'Name' => 'HandleCursorPosProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4129' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClient*, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1453',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4160' => {
                                      'BaseType' => '4172',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '196',
                                      'Name' => 'SoftCursorLockAreaProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4172' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4209' => {
                                      'BaseType' => '4221',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '197',
                                      'Name' => 'SoftCursorUnlockScreenProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4221' => {
                                      'Name' => 'void(*)(struct _rfbClient*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4238' => {
                                      'BaseType' => '4172',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '208',
                                      'Name' => 'GotFrameBufferUpdateProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4250' => {
                                      'BaseType' => '4221',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '215',
                                      'Name' => 'FinishedFrameBufferUpdateProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4262' => {
                                      'BaseType' => '4274',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '216',
                                      'Name' => 'GetPasswordProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4274' => {
                                      'Name' => 'char*(*)(struct _rfbClient*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          }
                                                 },
                                      'Return' => '211',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4295' => {
                                      'BaseType' => '4307',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '217',
                                      'Name' => 'GetCredentialProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4307' => {
                                      'Name' => 'rfbCredential*(*)(struct _rfbClient*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '4333',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4333' => {
                                      'BaseType' => '2503',
                                      'Name' => 'rfbCredential*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4339' => {
                                      'BaseType' => '4351',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '218',
                                      'Name' => 'MallocFrameBufferProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4351' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClient*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          }
                                                 },
                                      'Return' => '1453',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4372' => {
                                      'BaseType' => '4384',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '219',
                                      'Name' => 'GotXCutTextProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4384' => {
                                      'Name' => 'void(*)(struct _rfbClient*, char const*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '1039'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4411' => {
                                      'BaseType' => '4221',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '220',
                                      'Name' => 'BellProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4423' => {
                                      'BaseType' => '4435',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '228',
                                      'Name' => 'GotCursorShapeProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4435' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, int, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          },
                                                   '5' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4477' => {
                                      'BaseType' => '4489',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '229',
                                      'Name' => 'GotCopyRectProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4489' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, int, int, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          },
                                                   '5' => {
                                                            'type' => '137'
                                                          },
                                                   '6' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '45' => {
                                    'BaseType' => '57',
                                    'Header' => 'stddef.h',
                                    'Line' => '209',
                                    'Name' => 'size_t',
                                    'PrivateABI' => 1,
                                    'Size' => '8',
                                    'Type' => 'Typedef'
                                  },
                          '4536' => {
                                      'BaseType' => '4548',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '230',
                                      'Name' => 'GotFillRectProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4548' => {
                                      'Name' => 'void(*)(struct _rfbClient*, int, int, int, int, uint32_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '137'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          },
                                                   '5' => {
                                                            'type' => '1074'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4590' => {
                                      'BaseType' => '4602',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '231',
                                      'Name' => 'GotBitmapProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4602' => {
                                      'Name' => 'void(*)(struct _rfbClient*, uint8_t const*, int, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '4644'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          },
                                                   '5' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4644' => {
                                      'BaseType' => '1057',
                                      'Name' => 'uint8_t const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4650' => {
                                      'BaseType' => '4662',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '232',
                                      'Name' => 'GotJpegProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4662' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClient*, uint8_t const*, int, int, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2554'
                                                          },
                                                   '1' => {
                                                            'type' => '4644'
                                                          },
                                                   '2' => {
                                                            'type' => '137'
                                                          },
                                                   '3' => {
                                                            'type' => '137'
                                                          },
                                                   '4' => {
                                                            'type' => '137'
                                                          },
                                                   '5' => {
                                                            'type' => '137'
                                                          },
                                                   '6' => {
                                                            'type' => '137'
                                                          }
                                                 },
                                      'Return' => '1453',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4713' => {
                                      'BaseType' => '4351',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '233',
                                      'Name' => 'LockWriteToTLSProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4725' => {
                                      'BaseType' => '4351',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '234',
                                      'Name' => 'UnlockWriteToTLSProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4737' => {
                                      'Header' => 'rfbclient.h',
                                      'Line' => '255',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x',
                                                           'offset' => '0',
                                                           'type' => '137'
                                                         },
                                                  '1' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '137'
                                                         },
                                                  '2' => {
                                                           'name' => 'w',
                                                           'offset' => '8',
                                                           'type' => '137'
                                                         },
                                                  '3' => {
                                                           'name' => 'h',
                                                           'offset' => '18',
                                                           'type' => '137'
                                                         }
                                                },
                                      'Name' => 'anon-struct-rfbclient.h-255',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '4795' => {
                                      'BaseType' => '1045',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4801' => {
                                      'BaseType' => '217',
                                      'Name' => 'char[307200]',
                                      'Size' => '307200',
                                      'Type' => 'Array'
                                    },
                          '4820' => {
                                      'BaseType' => '217',
                                      'Name' => 'char[8192]',
                                      'Size' => '8192',
                                      'Type' => 'Array'
                                    },
                          '4837' => {
                                      'BaseType' => '217',
                                      'Name' => 'char[30000]',
                                      'Size' => '30000',
                                      'Type' => 'Array'
                                    },
                          '4854' => {
                                      'BaseType' => '1441',
                                      'Name' => 'z_stream[4]',
                                      'Size' => '448',
                                      'Type' => 'Array'
                                    },
                          '4870' => {
                                      'BaseType' => '1453',
                                      'Name' => 'rfbBool[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '4886' => {
                                      'BaseType' => '217',
                                      'Name' => 'char[1024]',
                                      'Size' => '1024',
                                      'Type' => 'Array'
                                    },
                          '4903' => {
                                      'BaseType' => '1045',
                                      'Name' => 'uint8_t[12288]',
                                      'Size' => '12288',
                                      'Type' => 'Array'
                                    },
                          '4920' => {
                                      'Header' => 'jpeglib.h',
                                      'Line' => '802',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_input_byte',
                                                           'offset' => '0',
                                                           'type' => '138212'
                                                         },
                                                  '1' => {
                                                           'name' => 'bytes_in_buffer',
                                                           'offset' => '8',
                                                           'type' => '45'
                                                         },
                                                  '2' => {
                                                           'name' => 'init_source',
                                                           'offset' => '22',
                                                           'type' => '138229'
                                                         },
                                                  '3' => {
                                                           'name' => 'fill_input_buffer',
                                                           'offset' => '36',
                                                           'type' => '138250'
                                                         },
                                                  '4' => {
                                                           'name' => 'skip_input_data',
                                                           'offset' => '50',
                                                           'type' => '138272'
                                                         },
                                                  '5' => {
                                                           'name' => 'resync_to_restart',
                                                           'offset' => '64',
                                                           'type' => '138298'
                                                         },
                                                  '6' => {
                                                           'name' => 'term_source',
                                                           'offset' => '72',
                                                           'type' => '138229'
                                                         }
                                                },
                                      'Name' => 'struct jpeg_source_mgr',
                                      'PrivateABI' => 1,
                                      'Size' => '56',
                                      'Type' => 'Struct'
                                    },
                          '4925' => {
                                      'BaseType' => '4920',
                                      'Name' => 'struct jpeg_source_mgr*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4931' => {
                                      'BaseType' => '2138',
                                      'Name' => 'rfbClientData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4937' => {
                                      'BaseType' => '2067',
                                      'Name' => 'rfbVNCRec*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4943' => {
                                      'BaseType' => '1074',
                                      'Name' => 'uint32_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4949' => {
                                      'BaseType' => '2560',
                                      'Header' => 'rfbclient.h',
                                      'Line' => '480',
                                      'Name' => 'rfbClient',
                                      'Size' => '359984',
                                      'Type' => 'Typedef'
                                    },
                          '4962' => {
                                      'BaseType' => '4949',
                                      'Name' => 'rfbClient*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '57' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '620' => {
                                     'BaseType' => '229',
                                     'Header' => 'FILE.h',
                                     'Line' => '7',
                                     'Name' => 'FILE',
                                     'PrivateABI' => 1,
                                     'Size' => '216',
                                     'Type' => 'Typedef'
                                   },
                          '632' => {
                                     'BaseType' => '1',
                                     'Header' => 'struct_FILE.h',
                                     'Line' => '43',
                                     'Name' => '_IO_lock_t',
                                     'PrivateABI' => 1,
                                     'Type' => 'Typedef'
                                   },
                          '64' => {
                                    'Name' => 'unsigned int',
                                    'Size' => '4',
                                    'Type' => 'Intrinsic'
                                  },
                          '640' => {
                                     'Name' => 'struct _IO_marker',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '645' => {
                                     'BaseType' => '640',
                                     'Name' => 'struct _IO_marker*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '651' => {
                                     'BaseType' => '229',
                                     'Name' => 'struct _IO_FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '657' => {
                                     'BaseType' => '217',
                                     'Name' => 'char[1]',
                                     'Size' => '1',
                                     'Type' => 'Array'
                                   },
                          '673' => {
                                     'BaseType' => '632',
                                     'Name' => '_IO_lock_t*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '679' => {
                                     'Name' => 'struct _IO_codecvt',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '684' => {
                                     'BaseType' => '679',
                                     'Name' => 'struct _IO_codecvt*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '690' => {
                                     'Name' => 'struct _IO_wide_data',
                                     'PrivateABI' => 1,
                                     'Type' => 'Struct'
                                   },
                          '695' => {
                                     'BaseType' => '690',
                                     'Name' => 'struct _IO_wide_data*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '701' => {
                                     'BaseType' => '217',
                                     'Name' => 'char[20]',
                                     'Size' => '20',
                                     'Type' => 'Array'
                                   },
                          '71' => {
                                    'BaseType' => '1',
                                    'Name' => 'void*',
                                    'Size' => '8',
                                    'Type' => 'Pointer'
                                  },
                          '717' => {
                                     'BaseType' => '620',
                                     'Name' => 'FILE*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '73' => {
                                    'Name' => 'unsigned char',
                                    'Size' => '1',
                                    'Type' => 'Intrinsic'
                                  },
                          '730' => {
                                     'BaseType' => '87',
                                     'Header' => 'stdint-intn.h',
                                     'Line' => '24',
                                     'Name' => 'int8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '742' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '187'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '199'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '789' => {
                                     'Header' => 'thread-shared-types.h',
                                     'Line' => '51',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__prev',
                                                          'offset' => '0',
                                                          'type' => '829'
                                                        },
                                                 '1' => {
                                                          'name' => '__next',
                                                          'offset' => '8',
                                                          'type' => '829'
                                                        }
                                               },
                                     'Name' => 'struct __pthread_internal_list',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '80' => {
                                    'Name' => 'unsigned short',
                                    'Size' => '2',
                                    'Type' => 'Intrinsic'
                                  },
                          '829' => {
                                     'BaseType' => '789',
                                     'Name' => 'struct __pthread_internal_list*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '835' => {
                                     'BaseType' => '789',
                                     'Header' => 'thread-shared-types.h',
                                     'Line' => '55',
                                     'Name' => '__pthread_list_t',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Typedef'
                                   },
                          '847' => {
                                     'Header' => 'struct_mutex.h',
                                     'Line' => '22',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => '__lock',
                                                          'offset' => '0',
                                                          'type' => '137'
                                                        },
                                                 '1' => {
