$VAR1 = {
          'ABI_DUMPER_VERSION' => '1.2',
          'ABI_DUMP_VERSION' => '3.5',
          'Arch' => 'x86_64',
          'GccVersion' => '11.3.0',
          'Headers' => {
                         'rfb.h' => 1,
                         'rfbproto.h' => 1,
                         'rfbregion.h' => 1
                       },
          'Language' => 'C',
          'LibraryName' => 'libvncserver.so.0.9.14',
          'LibraryVersion' => 'v1',
          'NameSpaces' => {},
          'Needed' => {
                        'libc.so.6' => 1,
                        'libgcrypt.so.20' => 1,
                        'libgnutls.so.30' => 1,
                        'libjpeg.so.8' => 1,
                        'liblzo2.so.2' => 1,
                        'libpng16.so.16' => 1,
                        'libz.so.1' => 1
                      },
          'PublicABI' => '1',
          'Sources' => {
                         'auth.c' => 1,
                         'cargs.c' => 1,
                         'corre.c' => 1,
                         'cursor.c' => 1,
                         'cutpaste.c' => 1,
                         'draw.c' => 1,
                         'font.c' => 1,
                         'hextile.c' => 1,
                         'httpd.c' => 1,
                         'main.c' => 1,
                         'rfbregion.c' => 1,
                         'rfbserver.c' => 1,
                         'rfbtightserver.c' => 1,
                         'rre.c' => 1,

                                                       'webSocketsCheck' => 1,
                                                       'webSocketsDecode' => 1,
                                                       'webSocketsDecodeHybi' => 1,
                                                       'webSocketsEncode' => 1,
                                                       'webSocketsHasDataInBuffer' => 1,
                                                       'zrleEncodeTile15BE' => 1,
                                                       'zrleEncodeTile15LE' => 1,
                                                       'zrleEncodeTile16BE' => 1,
                                                       'zrleEncodeTile16LE' => 1,
                                                       'zrleEncodeTile24ABE' => 1,
                                                       'zrleEncodeTile24ALE' => 1,
                                                       'zrleEncodeTile24BBE' => 1,
                                                       'zrleEncodeTile24BLE' => 1,
                                                       'zrleEncodeTile32BE' => 1,
                                                       'zrleEncodeTile32LE' => 1,
                                                       'zrleEncodeTile8NE' => 1,
                                                       'zrleOutStreamFlush' => 1,
                                                       'zrleOutStreamFree' => 1,
                                                       'zrleOutStreamNew' => 1,
                                                       'zrleOutStreamWriteBytes' => 1,
                                                       'zrleOutStreamWriteOpaque16' => 1,
                                                       'zrleOutStreamWriteOpaque24A' => 1,
                                                       'zrleOutStreamWriteOpaque24B' => 1,
                                                       'zrleOutStreamWriteOpaque32' => 1,
                                                       'zrleOutStreamWriteOpaque8' => 1,
                                                       'zrleOutStreamWriteU8' => 1,
                                                       'zrlePaletteHelperInit' => 1,
                                                       'zrlePaletteHelperInsert' => 1,
                                                       'zrlePaletteHelperLookup' => 1,
                                                       'zywrleAnalyze15BE' => 1,
                                                       'zywrleAnalyze15LE' => 1,
                                                       'zywrleAnalyze16BE' => 1,
                                                       'zywrleAnalyze16LE' => 1,
                                                       'zywrleAnalyze32BE' => 1,
                                                       'zywrleAnalyze32LE' => 1
                                                     }
                       },
          'Target' => 'unix',
          'TypeInfo' => {
                          '-1' => {
                                    'Name' => '...',
                                    'Type' => 'Intrinsic'
                                  },
                          '1' => {
                                   'Name' => 'void',
                                   'Type' => 'Intrinsic'
                                 },
                          '1016' => {
                                      'BaseType' => '259',
                                      'Header' => 'select.h',
                                      'Line' => '49',
                                      'Name' => '__fd_mask',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1051' => {
                                      'BaseType' => '1016',
                                      'Name' => '__fd_mask[16]',
                                      'Size' => '128',
                                      'Type' => 'Array'
                                    },
                          '1067' => {
                                      'Header' => 'select.h',
                                      'Line' => '70',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__fds_bits',
                                                           'offset' => '0',
                                                           'type' => '1051'
                                                         }
                                                },
                                      'Name' => 'struct fd_set',
                                      'PrivateABI' => 1,
                                      'Size' => '128',
                                      'Type' => 'Struct'
                                    },
                          '1079' => {
                                      'Header' => 'atomic_wide_counter.h',
                                      'Line' => '28',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__low',
                                                           'offset' => '0',
                                                           'type' => '162'
                                                         },
                                                  '1' => {
                                                           'name' => '__high',
                                                           'offset' => '4',
                                                           'type' => '162'
                                                         }
                                                },
                                      'Name' => 'anon-struct-atomic_wide_counter.h-28',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '108719' => {
                                        'BaseType' => '2352',
                                        'Name' => 'in_addr_t*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '11467' => {
                                       'BaseType' => '9871',
                                       'Name' => 'sraRectangleIterator*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1149' => {
                                      'Name' => 'unsigned long long',
                                      'Size' => '8',
                                      'Type' => 'Intrinsic'
                                    },
                          '11500' => {
                                       'BaseType' => '9746',
                                       'Name' => 'sraRect*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '11538' => {
                                       'BaseType' => '9758',
                                       'Name' => 'sraRegion*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1156' => {
                                      'Header' => 'atomic_wide_counter.h',
                                      'Line' => '33',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__value64',
                                                           'offset' => '0',
                                                           'type' => '1149'
                                                         },
                                                  '1' => {
                                                           'name' => '__value32',
                                                           'offset' => '0',
                                                           'type' => '1079'
                                                         }
                                                },
                                      'Name' => 'union __atomic_wide_counter',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '1168' => {
                                      'Header' => 'thread-shared-types.h',
                                      'Line' => '51',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__prev',
                                                           'offset' => '0',
                                                           'type' => '1208'
                                                         },
                                                  '1' => {
                                                           'name' => '__next',
                                                           'offset' => '8',
                                                           'type' => '1208'
                                                         }
                                                },
                                      'Name' => 'struct __pthread_internal_list',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '11691' => {
                                       'BaseType' => '9770',
                                       'Name' => 'sraRegion const*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '1208' => {
                                      'BaseType' => '1168',
                                      'Name' => 'struct __pthread_internal_list*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1214' => {
                                      'BaseType' => '1168',
                                      'Header' => 'thread-shared-types.h',
                                      'Line' => '55',
                                      'Name' => '__pthread_list_t',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '1226' => {
                                      'Header' => 'struct_mutex.h',
                                      'Line' => '22',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__lock',
                                                           'offset' => '0',
                                                           'type' => '240'
                                                         },
                                                  '1' => {
                                                           'name' => '__count',
                                                           'offset' => '4',
                                                           'type' => '162'
                                                         },
                                                  '2' => {
                                                           'name' => '__owner',
                                                           'offset' => '8',
                                                           'type' => '240'
                                                         },
                                                  '3' => {
                                                           'name' => '__nusers',
                                                           'offset' => '18',
                                                           'type' => '162'
                                                         },
                                                  '4' => {
                                                           'name' => '__kind',
                                                           'offset' => '22',
                                                           'type' => '240'
                                                         },
                                                  '5' => {
                                                           'name' => '__spins',
                                                           'offset' => '32',
                                                           'type' => '221'
                                                         },
                                                  '6' => {
                                                           'name' => '__elision',
                                                           'offset' => '34',
                                                           'type' => '221'
                                                         },
                                                  '7' => {
                                                           'name' => '__list',
                                                           'offset' => '36',
                                                           'type' => '1214'
                                                         }
                                                },
                                      'Name' => 'struct __pthread_mutex_s',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '125037' => {
                                        'BaseType' => '9224',
                                        'Header' => 'rfb.h',
                                        'Line' => '420',
                                        'Name' => 'rfbStatList',
                                        'Size' => '40',
                                        'Type' => 'Typedef'
                                      },
                          '126234' => {
                                        'BaseType' => '125037',
                                        'Name' => 'rfbStatList*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '1344' => {
                                      'Header' => 'thread-shared-types.h',
                                      'Line' => '94',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__wseq',
                                                           'offset' => '0',
                                                           'type' => '1156'
                                                         },
                                                  '1' => {
                                                           'name' => '__g1_start',
                                                           'offset' => '8',
                                                           'type' => '1156'
                                                         },
                                                  '2' => {
                                                           'name' => '__g_refs',
                                                           'offset' => '22',
                                                           'type' => '1449'
                                                         },
                                                  '3' => {
                                                           'name' => '__g_size',
                                                           'offset' => '36',
                                                           'type' => '1449'
                                                         },
                                                  '4' => {
                                                           'name' => '__g1_orig_size',
                                                           'offset' => '50',
                                                           'type' => '162'
                                                         },
                                                  '5' => {
                                                           'name' => '__wrefs',
                                                           'offset' => '54',
                                                           'type' => '162'
                                                         },
                                                  '6' => {
                                                           'name' => '__g_signals',
                                                           'offset' => '64',
                                                           'type' => '1449'
                                                         }
                                                },
                                      'Name' => 'struct __pthread_cond_s',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Struct'
                                    },
                          '1449' => {
                                      'BaseType' => '162',
                                      'Name' => 'unsigned int[2]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '1465' => {
                                      'BaseType' => '57',
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '27',
                                      'Name' => 'pthread_t',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '162' => {
                                     'Name' => 'unsigned int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '1645' => {
                                      'BaseType' => '365',
                                      'Name' => 'char[40]',
                                      'Size' => '40',
                                      'Type' => 'Array'
                                    },
                          '1661' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '72',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__data',
                                                           'offset' => '0',
                                                           'type' => '1226'
                                                         },
                                                  '1' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '1645'
                                                         },
                                                  '2' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '259'
                                                         }
                                                },
                                      'Name' => 'union pthread_mutex_t',
                                      'PrivateABI' => 1,
                                      'Size' => '40',
                                      'Type' => 'Union'
                                    },
                          '169' => {
                                     'BaseType' => '1',
                                     'Name' => 'void*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '1719' => {
                                      'BaseType' => '365',
                                      'Name' => 'char[48]',
                                      'Size' => '48',
                                      'Type' => 'Array'
                                    },
                          '1735' => {
                                      'Header' => 'pthreadtypes.h',
                                      'Line' => '80',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '__data',
                                                           'offset' => '0',
                                                           'type' => '1344'
                                                         },
                                                  '1' => {
                                                           'name' => '__size',
                                                           'offset' => '0',
                                                           'type' => '1719'
                                                         },
                                                  '2' => {
                                                           'name' => '__align',
                                                           'offset' => '0',
                                                           'type' => '940'
                                                         }
                                                },
                                      'Name' => 'union pthread_cond_t',
                                      'PrivateABI' => 1,
                                      'Size' => '48',
                                      'Type' => 'Union'
                                    },
                          '1759' => {
                                      'BaseType' => '372',
                                      'Name' => 'char const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '176' => {
                                     'Name' => 'unsigned char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '1770' => {
                                      'BaseType' => '209',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '24',
                                      'Name' => 'uint8_t',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1782' => {
                                      'BaseType' => '228',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '25',
                                      'Name' => 'uint16_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '1794' => {
                                      'BaseType' => '247',
                                      'Header' => 'stdint-uintn.h',
                                      'Line' => '26',
                                      'Name' => 'uint32_t',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '1806' => {
                                      'BaseType' => '176',
                                      'Header' => 'zconf.h',
                                      'Line' => '391',
                                      'Name' => 'Byte',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1819' => {
                                      'BaseType' => '162',
                                      'Header' => 'zconf.h',
                                      'Line' => '393',
                                      'Name' => 'uInt',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '183' => {
                                     'Name' => 'unsigned short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '1832' => {
                                      'BaseType' => '57',
                                      'Header' => 'zconf.h',
                                      'Line' => '394',
                                      'Name' => 'uLong',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1845' => {
                                      'BaseType' => '1806',
                                      'Header' => 'zconf.h',
                                      'Line' => '400',
                                      'Name' => 'Bytef',
                                      'PrivateABI' => 1,
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '1858' => {
                                      'BaseType' => '169',
                                      'Header' => 'zconf.h',
                                      'Line' => '409',
                                      'Name' => 'voidpf',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1884' => {
                                      'BaseType' => '354',
                                      'Name' => 'char**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '1890' => {
                                      'BaseType' => '1902',
                                      'Header' => 'zlib.h',
                                      'Line' => '81',
                                      'Name' => 'alloc_func',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '190' => {
                                     'BaseType' => '202',
                                     'Header' => 'types.h',
                                     'Line' => '37',
                                     'Name' => '__int8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '1902' => {
                                      'Name' => 'voidpf(*)(voidpf, uInt, uInt)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1858'
                                                          },
                                                   '1' => {
                                                            'type' => '1819'
                                                          },
                                                   '2' => {
                                                            'type' => '1819'
                                                          }
                                                 },
                                      'Return' => '1858',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1933' => {
                                      'BaseType' => '1945',
                                      'Header' => 'zlib.h',
                                      'Line' => '82',
                                      'Name' => 'free_func',
                                      'PrivateABI' => 1,
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '1945' => {
                                      'Name' => 'void(*)(voidpf, voidpf)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1858'
                                                          },
                                                   '1' => {
                                                            'type' => '1858'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '1967' => {
                                      'Header' => 'zlib.h',
                                      'Line' => '86',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next_in',
                                                           'offset' => '0',
                                                           'type' => '2163'
                                                         },
                                                  '1' => {
                                                           'name' => 'avail_in',
                                                           'offset' => '8',
                                                           'type' => '1819'
                                                         },
                                                  '10' => {
                                                            'name' => 'opaque',
                                                            'offset' => '128',
                                                            'type' => '1858'
                                                          },
                                                  '11' => {
                                                            'name' => 'data_type',
                                                            'offset' => '136',
                                                            'type' => '240'
                                                          },
                                                  '12' => {
                                                            'name' => 'adler',
                                                            'offset' => '150',
                                                            'type' => '1832'
                                                          },
                                                  '13' => {
                                                            'name' => 'reserved',
                                                            'offset' => '260',
                                                            'type' => '1832'
                                                          },
                                                  '2' => {
                                                           'name' => 'total_in',
                                                           'offset' => '22',
                                                           'type' => '1832'
                                                         },
                                                  '3' => {
                                                           'name' => 'next_out',
                                                           'offset' => '36',
                                                           'type' => '2163'
                                                         },
                                                  '4' => {
                                                           'name' => 'avail_out',
                                                           'offset' => '50',
                                                           'type' => '1819'
                                                         },
                                                  '5' => {
                                                           'name' => 'total_out',
                                                           'offset' => '64',
                                                           'type' => '1832'
                                                         },
                                                  '6' => {
                                                           'name' => 'msg',
                                                           'offset' => '72',
                                                           'type' => '354'
                                                         },
                                                  '7' => {
                                                           'name' => 'state',
                                                           'offset' => '86',
                                                           'type' => '2174'
                                                         },
                                                  '8' => {
                                                           'name' => 'zalloc',
                                                           'offset' => '100',
                                                           'type' => '1890'
                                                         },
                                                  '9' => {
                                                           'name' => 'zfree',
                                                           'offset' => '114',
                                                           'type' => '1933'
                                                         }
                                                },
                                      'Name' => 'struct z_stream_s',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Struct'
                                    },
                          '202' => {
                                     'Name' => 'signed char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '209' => {
                                     'BaseType' => '176',
                                     'Header' => 'types.h',
                                     'Line' => '38',
                                     'Name' => '__uint8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '2163' => {
                                      'BaseType' => '1845',
                                      'Name' => 'Bytef*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2169' => {
                                      'Name' => 'struct internal_state',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '2174' => {
                                      'BaseType' => '2169',
                                      'Name' => 'struct internal_state*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2180' => {
                                      'BaseType' => '1967',
                                      'Header' => 'zlib.h',
                                      'Line' => '106',
                                      'Name' => 'z_stream',
                                      'PrivateABI' => 1,
                                      'Size' => '112',
                                      'Type' => 'Typedef'
                                    },
                          '2192' => {
                                      'BaseType' => '176',
                                      'Name' => 'unsigned char*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '2198' => {
                                      'BaseType' => '183',
                                      'Header' => 'sockaddr.h',
                                      'Line' => '28',
                                      'Name' => 'sa_family_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '221' => {
                                     'Name' => 'short',
                                     'Size' => '2',
                                     'Type' => 'Intrinsic'
                                   },
                          '228' => {
                                     'BaseType' => '183',
                                     'Header' => 'types.h',
                                     'Line' => '40',
                                     'Name' => '__uint16_t',
                                     'PrivateABI' => 1,
                                     'Size' => '2',
                                     'Type' => 'Typedef'
                                   },
                          '2335' => {
                                      'Name' => 'void(*)(int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '2352' => {
                                      'BaseType' => '1794',
                                      'Header' => 'rfb.h',
                                      'Line' => '30',
                                      'Name' => 'in_addr_t',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2364' => {
                                      'Header' => 'in.h',
                                      'Line' => '31',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 's_addr',
                                                           'offset' => '0',
                                                           'type' => '2352'
                                                         }
                                                },
                                      'Name' => 'struct in_addr',
                                      'PrivateABI' => 1,
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '2391' => {
                                      'BaseType' => '1782',
                                      'Header' => 'in.h',
                                      'Line' => '123',
                                      'Name' => 'in_port_t',
                                      'PrivateABI' => 1,
                                      'Size' => '2',
                                      'Type' => 'Typedef'
                                    },
                          '239183' => {
                                        'BaseType' => '176',
                                        'Name' => 'unsigned char[256]',
                                        'Size' => '256',
                                        'Type' => 'Array'
                                      },
                          '240' => {
                                     'Name' => 'int',
                                     'Size' => '4',
                                     'Type' => 'Intrinsic'
                                   },
                          '2403' => {
                                      'BaseType' => '1770',
                                      'Name' => 'uint8_t[16]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '2419' => {
                                      'Header' => 'in.h',
                                      'Line' => '245',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'sin_family',
                                                           'offset' => '0',
                                                           'type' => '2198'
                                                         },
                                                  '1' => {
                                                           'name' => 'sin_port',
                                                           'offset' => '2',
                                                           'type' => '2391'
                                                         },
                                                  '2' => {
                                                           'name' => 'sin_addr',
                                                           'offset' => '4',
                                                           'type' => '2364'
                                                         },
                                                  '3' => {
                                                           'name' => 'sin_zero',
                                                           'offset' => '8',
                                                           'type' => '2485'
                                                         }
                                                },
                                      'Name' => 'struct sockaddr_in',
                                      'PrivateABI' => 1,
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '247' => {
                                     'BaseType' => '162',
                                     'Header' => 'types.h',
                                     'Line' => '42',
                                     'Name' => '__uint32_t',
                                     'PrivateABI' => 1,
                                     'Size' => '4',
                                     'Type' => 'Typedef'
                                   },
                          '2485' => {
                                      'BaseType' => '176',
                                      'Name' => 'unsigned char[8]',
                                      'Size' => '8',
                                      'Type' => 'Array'
                                    },
                          '2501' => {
                                      'BaseType' => '964',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '108',
                                      'Name' => 'rfbBool',
                                      'Size' => '1',
                                      'Type' => 'Typedef'
                                    },
                          '2513' => {
                                      'BaseType' => '1794',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '122',
                                      'Name' => 'rfbKeySym',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '2525' => {
                                      'BaseType' => '1794',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '123',
                                      'Name' => 'rfbPixel',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '255088' => {
                                        'Header' => 'rfb.h',
                                        'Line' => '964',
                                        'Memb' => {
                                                    '0' => {
                                                             'name' => 'data',
                                                             'offset' => '0',
                                                             'type' => '2192'
                                                           },
                                                    '1' => {
                                                             'name' => 'metaData',
                                                             'offset' => '8',
                                                             'type' => '8704'
                                                           }
                                                  },
                                        'Name' => 'struct rfbFontData',
                                        'Size' => '16',
                                        'Type' => 'Struct'
                                      },
                          '255131' => {
                                        'BaseType' => '255144',
                                        'Header' => 'rfb.h',
                                        'Line' => '972',
                                        'Name' => 'rfbFontDataPtr',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '255144' => {
                                        'BaseType' => '255088',
                                        'Name' => 'struct rfbFontData*',
                                        'Size' => '8',
                                        'Type' => 'Pointer'
                                      },
                          '259' => {
                                     'Name' => 'long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '2703' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '207',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bitsPerPixel',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'depth',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '10' => {
                                                            'name' => 'pad1',
                                                            'offset' => '19',
                                                            'type' => '1770'
                                                          },
                                                  '11' => {
                                                            'name' => 'pad2',
                                                            'offset' => '20',
                                                            'type' => '1782'
                                                          },
                                                  '2' => {
                                                           'name' => 'bigEndian',
                                                           'offset' => '2',
                                                           'type' => '1770'
                                                         },
                                                  '3' => {
                                                           'name' => 'trueColour',
                                                           'offset' => '3',
                                                           'type' => '1770'
                                                         },
                                                  '4' => {
                                                           'name' => 'redMax',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         },
                                                  '5' => {
                                                           'name' => 'greenMax',
                                                           'offset' => '6',
                                                           'type' => '1782'
                                                         },
                                                  '6' => {
                                                           'name' => 'blueMax',
                                                           'offset' => '8',
                                                           'type' => '1782'
                                                         },
                                                  '7' => {
                                                           'name' => 'redShift',
                                                           'offset' => '16',
                                                           'type' => '1770'
                                                         },
                                                  '8' => {
                                                           'name' => 'greenShift',
                                                           'offset' => '17',
                                                           'type' => '1770'
                                                         },
                                                  '9' => {
                                                           'name' => 'blueShift',
                                                           'offset' => '18',
                                                           'type' => '1770'
                                                         }
                                                },
                                      'Name' => 'struct rfbPixelFormat',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '2715' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1026',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'contentType',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'contentParam',
                                                           'offset' => '2',
                                                           'type' => '1770'
                                                         },
                                                  '3' => {
                                                           'name' => 'pad',
                                                           'offset' => '3',
                                                           'type' => '1770'
                                                         },
                                                  '4' => {
                                                           'name' => 'size',
                                                           'offset' => '4',
                                                           'type' => '1794'
                                                         },
                                                  '5' => {
                                                           'name' => 'length',
                                                           'offset' => '8',
                                                           'type' => '1794'
                                                         }
                                                },
                                      'Name' => 'struct _rfbFileTransferMsg',
                                      'Size' => '12',
                                      'Type' => 'Struct'
                                    },
                          '276295' => {
                                        'BaseType' => '2335',
                                        'Header' => 'rfb.h',
                                        'Line' => '1002',
                                        'Name' => 'SelectionChangedHookPtr',
                                        'Size' => '8',
                                        'Type' => 'Typedef'
                                      },
                          '2814' => {
                                      'BaseType' => '2715',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1035',
                                      'Name' => 'rfbFileTransferMsg',
                                      'Size' => '12',
                                      'Type' => 'Typedef'
                                    },
                          '2827' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1102',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad1',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad2',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '4',
                                                           'type' => '1794'
                                                         }
                                                },
                                      'Name' => 'struct _rfbTextChatMsg',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '2898' => {
                                      'BaseType' => '2827',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1108',
                                      'Name' => 'rfbTextChatMsg',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '290' => {
                                     'BaseType' => '240',
                                     'Name' => 'int[2]',
                                     'Size' => '8',
                                     'Type' => 'Array'
                                   },
                          '2978' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'version',
                                                           'offset' => '2',
                                                           'type' => '1770'
                                                         },
                                                  '3' => {
                                                           'name' => 'code',
                                                           'offset' => '3',
                                                           'type' => '1770'
                                                         }
                                                },
                                      'Name' => 'struct rfbXvpMsg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '2991' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1171',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'id',
                                                           'offset' => '0',
                                                           'type' => '1794'
                                                         },
                                                  '1' => {
                                                           'name' => 'x',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         },
                                                  '2' => {
                                                           'name' => 'y',
                                                           'offset' => '6',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'width',
                                                           'offset' => '8',
                                                           'type' => '1782'
                                                         },
                                                  '4' => {
                                                           'name' => 'height',
                                                           'offset' => '16',
                                                           'type' => '1782'
                                                         },
                                                  '5' => {
                                                           'name' => 'flags',
                                                           'offset' => '18',
                                                           'type' => '1794'
                                                         }
                                                },
                                      'Name' => 'struct rfbExtDesktopScreen',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '306' => {
                                     'BaseType' => '259',
                                     'Header' => 'types.h',
                                     'Line' => '160',
                                     'Name' => '__time_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3098' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1201',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad1',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'width',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'height',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         },
                                                  '4' => {
                                                           'name' => 'numberOfScreens',
                                                           'offset' => '6',
                                                           'type' => '1770'
                                                         },
                                                  '5' => {
                                                           'name' => 'pad2',
                                                           'offset' => '7',
                                                           'type' => '1770'
                                                         }
                                                },
                                      'Name' => 'struct rfbSetDesktopSizeMsg',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '3197' => {
                                      'BaseType' => '3098',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1210',
                                      'Name' => 'rfbSetDesktopSizeMsg',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '3277' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1306',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad1',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad2',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'format',
                                                           'offset' => '4',
                                                           'type' => '2703'
                                                         }
                                                },
                                      'Name' => 'struct rfbSetPixelFormatMsg',
                                      'Size' => '20',
                                      'Type' => 'Struct'
                                    },
                          '330' => {
                                     'BaseType' => '259',
                                     'Header' => 'types.h',
                                     'Line' => '162',
                                     'Name' => '__suseconds_t',
                                     'PrivateABI' => 1,
                                     'Size' => '8',
                                     'Type' => 'Typedef'
                                   },
                          '3357' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1327',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'firstColour',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'nColours',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct rfbFixColourMapEntriesMsg',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '3423' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1343',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'nEncodings',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct rfbSetEncodingsMsg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3523' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1361',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'incremental',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'x',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         },
                                                  '4' => {
                                                           'name' => 'w',
                                                           'offset' => '6',
                                                           'type' => '1782'
                                                         },
                                                  '5' => {
                                                           'name' => 'h',
                                                           'offset' => '8',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct rfbFramebufferUpdateRequestMsg',
                                      'Size' => '10',
                                      'Type' => 'Struct'
                                    },
                          '354' => {
                                     'BaseType' => '365',
                                     'Name' => 'char*',
                                     'Size' => '8',
                                     'Type' => 'Pointer'
                                   },
                          '3603' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1402',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'down',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'key',
                                                           'offset' => '4',
                                                           'type' => '1794'
                                                         }
                                                },
                                      'Name' => 'struct rfbKeyEventMsg',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '365' => {
                                     'Name' => 'char',
                                     'Size' => '1',
                                     'Type' => 'Intrinsic'
                                   },
                          '3679' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1427',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'buttonMask',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'x',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct rfbPointerEventMsg',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '372' => {
                                     'BaseType' => '365',
                                     'Name' => 'char const',
                                     'Size' => '1',
                                     'Type' => 'Const'
                                   },
                          '3759' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1452',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'pad1',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad2',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'length',
                                                           'offset' => '4',
                                                           'type' => '1794'
                                                         }
                                                },
                                      'Name' => 'struct rfbClientCutTextMsg',
                                      'Size' => '8',
                                      'Type' => 'Struct'
                                    },
                          '3772' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1473',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'scale',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct _rfbSetScaleMsg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3829' => {
                                      'BaseType' => '3772',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1477',
                                      'Name' => 'rfbSetScaleMsg',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3895' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1493',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'scale',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad2',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct rfbPalmVNCSetScaleFactorMsg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3908' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1503',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'pad',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct _rfbSetServerInputMsg',
                                      'Size' => '4',
                                      'Type' => 'Struct'
                                    },
                          '3965' => {
                                      'BaseType' => '3908',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1507',
                                      'Name' => 'rfbSetServerInputMsg',
                                      'Size' => '4',
                                      'Type' => 'Typedef'
                                    },
                          '3978' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1516',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'status',
                                                           'offset' => '1',
                                                           'type' => '1770'
                                                         },
                                                  '2' => {
                                                           'name' => 'x',
                                                           'offset' => '2',
                                                           'type' => '1782'
                                                         },
                                                  '3' => {
                                                           'name' => 'y',
                                                           'offset' => '4',
                                                           'type' => '1782'
                                                         }
                                                },
                                      'Name' => 'struct _rfbSetSWMsg',
                                      'Size' => '6',
                                      'Type' => 'Struct'
                                    },
                          '4045' => {
                                      'BaseType' => '3978',
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1521',
                                      'Name' => 'rfbSetSWMsg',
                                      'Size' => '6',
                                      'Type' => 'Typedef'
                                    },
                          '4271' => {
                                      'Header' => 'rfbproto.h',
                                      'Line' => '1548',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1770'
                                                         },
                                                  '1' => {
                                                           'name' => 'spf',
                                                           'offset' => '0',
                                                           'type' => '3277'
                                                         },
                                                  '10' => {
                                                            'name' => 'sim',
                                                            'offset' => '0',
                                                            'type' => '3965'
                                                          },
                                                  '11' => {
                                                            'name' => 'ft',
                                                            'offset' => '0',
                                                            'type' => '2814'
                                                          },
                                                  '12' => {
                                                            'name' => 'sw',
                                                            'offset' => '0',
                                                            'type' => '4045'
                                                          },
                                                  '13' => {
                                                            'name' => 'tc',
                                                            'offset' => '0',
                                                            'type' => '2898'
                                                          },
                                                  '14' => {
                                                            'name' => 'xvp',
                                                            'offset' => '0',
                                                            'type' => '2978'
                                                          },
                                                  '15' => {
                                                            'name' => 'sdm',
                                                            'offset' => '0',
                                                            'type' => '3197'
                                                          },
                                                  '2' => {
                                                           'name' => 'fcme',
                                                           'offset' => '0',
                                                           'type' => '3357'
                                                         },
                                                  '3' => {
                                                           'name' => 'se',
                                                           'offset' => '0',
                                                           'type' => '3423'
                                                         },
                                                  '4' => {
                                                           'name' => 'fur',
                                                           'offset' => '0',
                                                           'type' => '3523'
                                                         },
                                                  '5' => {
                                                           'name' => 'ke',
                                                           'offset' => '0',
                                                           'type' => '3603'
                                                         },
                                                  '6' => {
                                                           'name' => 'pe',
                                                           'offset' => '0',
                                                           'type' => '3679'
                                                         },
                                                  '7' => {
                                                           'name' => 'cct',
                                                           'offset' => '0',
                                                           'type' => '3759'
                                                         },
                                                  '8' => {
                                                           'name' => 'ssc',
                                                           'offset' => '0',
                                                           'type' => '3829'
                                                         },
                                                  '9' => {
                                                           'name' => 'pssf',
                                                           'offset' => '0',
                                                           'type' => '3895'
                                                         }
                                                },
                                      'Name' => 'union rfbClientToServerMsg',
                                      'Size' => '20',
                                      'Type' => 'Union'
                                    },
                          '4284' => {
                                      'BaseType' => '4271',
                                      'Name' => 'rfbClientToServerMsg const',
                                      'Size' => '20',
                                      'Type' => 'Const'
                                    },
                          '4450' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '91',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RFB_CLIENT_ACCEPT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RFB_CLIENT_ON_HOLD',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'RFB_CLIENT_REFUSE',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum rfbNewClientAction',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4487' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '97',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RFB_SOCKET_INIT',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RFB_SOCKET_READY',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'RFB_SOCKET_SHUTDOWN',
                                                           'value' => '2'
                                                         }
                                                },
                                      'Name' => 'enum rfbSocketState',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '4524' => {
                                      'BaseType' => '4536',
                                      'Header' => 'rfb.h',
                                      'Line' => '103',
                                      'Name' => 'rfbKbdAddEventProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '4536' => {
                                      'Name' => 'void(*)(rfbBool, rfbKeySym, struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '2501'
                                                          },
                                                   '1' => {
                                                            'type' => '2513'
                                                          },
                                                   '2' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '4563' => {
                                      'BaseType' => '4569',
                                      'Name' => 'struct _rfbClientRec*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '4569' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '425',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'screen',
                                                           'offset' => '0',
                                                           'type' => '8951'
                                                         },
                                                  '1' => {
                                                           'name' => 'scaledScreen',
                                                           'offset' => '8',
                                                           'type' => '8951'
                                                         },
                                                  '10' => {
                                                            'name' => 'state',
                                                            'offset' => '114',
                                                            'type' => '9393'
                                                          },
                                                  '100' => {
                                                             'name' => 'extClipboardData',
                                                             'offset' => '328978',
                                                             'type' => '354'
                                                           },
                                                  '101' => {
                                                             'name' => 'extClipboardDataSize',
                                                             'offset' => '328992',
                                                             'type' => '240'
                                                           },
                                                  '102' => {
                                                             'name' => 'tightUsePixelFormat24',
                                                             'offset' => '328996',
                                                             'type' => '2501'
                                                           },
                                                  '103' => {
                                                             'name' => 'tightTJ',
                                                             'offset' => '329000',
                                                             'type' => '169'
                                                           },
                                                  '104' => {
                                                             'name' => 'tightPngDstDataLen',
                                                             'offset' => '329014',
                                                             'type' => '240'
                                                           },
                                                  '11' => {
                                                            'name' => 'reverseConnection',
                                                            'offset' => '118',
                                                            'type' => '2501'
                                                          },
                                                  '12' => {
                                                            'name' => 'onHold',
                                                            'offset' => '119',
                                                            'type' => '2501'
                                                          },
                                                  '13' => {
                                                            'name' => 'readyForSetColourMapEntries',
                                                            'offset' => '120',
                                                            'type' => '2501'
                                                          },
                                                  '14' => {
                                                            'name' => 'useCopyRect',
                                                            'offset' => '121',
                                                            'type' => '2501'
                                                          },
                                                  '15' => {
                                                            'name' => 'preferredEncoding',
                                                            'offset' => '128',
                                                            'type' => '240'
                                                          },
                                                  '16' => {
                                                            'name' => 'correMaxWidth',
                                                            'offset' => '132',
                                                            'type' => '240'
                                                          },
                                                  '17' => {
                                                            'name' => 'correMaxHeight',
                                                            'offset' => '136',
                                                            'type' => '240'
                                                          },
                                                  '18' => {
                                                            'name' => 'viewOnly',
                                                            'offset' => '146',
                                                            'type' => '2501'
                                                          },
                                                  '19' => {
                                                            'name' => 'authChallenge',
                                                            'offset' => '147',
                                                            'type' => '2403'
                                                          },
                                                  '2' => {
                                                           'name' => 'PalmVNC',
                                                           'offset' => '22',
                                                           'type' => '2501'
                                                         },
                                                  '20' => {
                                                            'name' => 'copyRegion',
                                                            'offset' => '274',
                                                            'type' => '9035'
                                                          },
                                                  '21' => {
                                                            'name' => 'copyDX',
                                                            'offset' => '288',
                                                            'type' => '240'
                                                          },
                                                  '22' => {
                                                            'name' => 'copyDY',
                                                            'offset' => '292',
                                                            'type' => '240'
                                                          },
                                                  '23' => {
                                                            'name' => 'modifiedRegion',
                                                            'offset' => '296',
                                                            'type' => '9035'
                                                          },
                                                  '24' => {
                                                            'name' => 'requestedRegion',
                                                            'offset' => '310',
                                                            'type' => '9035'
                                                          },
                                                  '25' => {
                                                            'name' => 'startDeferring',
                                                            'offset' => '324',
                                                            'type' => '976'
                                                          },
                                                  '26' => {
                                                            'name' => 'startPtrDeferring',
                                                            'offset' => '352',
                                                            'type' => '976'
                                                          },
                                                  '27' => {
                                                            'name' => 'lastPtrX',
                                                            'offset' => '374',
                                                            'type' => '240'
                                                          },
                                                  '28' => {
                                                            'name' => 'lastPtrY',
                                                            'offset' => '384',
                                                            'type' => '240'
                                                          },
                                                  '29' => {
                                                            'name' => 'lastPtrButtons',
                                                            'offset' => '388',
                                                            'type' => '240'
                                                          },
                                                  '3' => {
                                                           'name' => 'clientData',
                                                           'offset' => '36',
                                                           'type' => '169'
                                                         },
                                                  '30' => {
                                                            'name' => 'translateFn',
                                                            'offset' => '402',
                                                            'type' => '8964'
                                                          },
                                                  '31' => {
                                                            'name' => 'translateLookupTable',
                                                            'offset' => '512',
                                                            'type' => '354'
                                                          },
                                                  '32' => {
                                                            'name' => 'format',
                                                            'offset' => '520',
                                                            'type' => '2703'
                                                          },
                                                  '33' => {
                                                            'name' => 'updateBuf',
                                                            'offset' => '548',
                                                            'type' => '9451'
                                                          },
                                                  '34' => {
                                                            'name' => 'ublen',
                                                            'offset' => '207250',
                                                            'type' => '240'
                                                          },
                                                  '35' => {
                                                            'name' => 'statEncList',
                                                            'offset' => '208896',
                                                            'type' => '9351'
                                                          },
                                                  '36' => {
                                                            'name' => 'statMsgList',
                                                            'offset' => '208904',
                                                            'type' => '9351'
                                                          },
                                                  '37' => {
                                                            'name' => 'rawBytesEquivalent',
                                                            'offset' => '208918',
                                                            'type' => '240'
                                                          },
                                                  '38' => {
                                                            'name' => 'bytesSent',
                                                            'offset' => '208928',
                                                            'type' => '240'
                                                          },
                                                  '39' => {
                                                            'name' => 'compStream',
                                                            'offset' => '208932',
                                                            'type' => '1967'
                                                          },
                                                  '4' => {
                                                           'name' => 'clientGoneHook',
                                                           'offset' => '50',
                                                           'type' => '9059'
                                                         },
                                                  '40' => {
                                                            'name' => 'compStreamInited',
                                                            'offset' => '209206',
                                                            'type' => '2501'
                                                          },
                                                  '41' => {
                                                            'name' => 'zlibCompressLevel',
                                                            'offset' => '209216',
                                                            'type' => '1794'
                                                          },
                                                  '42' => {
                                                            'name' => 'tightQualityLevel',
                                                            'offset' => '209220',
                                                            'type' => '240'
                                                          },
                                                  '43' => {
                                                            'name' => 'zsStruct',
                                                            'offset' => '209234',
                                                            'type' => '9468'
                                                          },
                                                  '44' => {
                                                            'name' => 'zsActive',
                                                            'offset' => '210432',
                                                            'type' => '9484'
                                                          },
                                                  '45' => {
                                                            'name' => 'zsLevel',
                                                            'offset' => '210436',
                                                            'type' => '9500'
                                                          },
                                                  '46' => {
                                                            'name' => 'tightCompressLevel',
                                                            'offset' => '210464',
                                                            'type' => '240'
                                                          },
                                                  '47' => {
                                                            'name' => 'compStreamInitedLZO',
                                                            'offset' => '210468',
                                                            'type' => '2501'
                                                          },
                                                  '48' => {
                                                            'name' => 'lzoWrkMem',
                                                            'offset' => '210482',
                                                            'type' => '354'
                                                          },
                                                  '49' => {
                                                            'name' => 'fileTransfer',
                                                            'offset' => '210496',
                                                            'type' => '9211'
                                                          },
                                                  '5' => {
                                                           'name' => 'sock',
                                                           'offset' => '64',
                                                           'type' => '240'
                                                         },
                                                  '50' => {
                                                            'name' => 'lastKeyboardLedState',
                                                            'offset' => '210532',
                                                            'type' => '240'
                                                          },
                                                  '51' => {
                                                            'name' => 'enableSupportedMessages',
                                                            'offset' => '210536',
                                                            'type' => '2501'
                                                          },
                                                  '52' => {
                                                            'name' => 'enableSupportedEncodings',
                                                            'offset' => '210537',
                                                            'type' => '2501'
                                                          },
                                                  '53' => {
                                                            'name' => 'enableServerIdentity',
                                                            'offset' => '210544',
                                                            'type' => '2501'
                                                          },
                                                  '54' => {
                                                            'name' => 'enableKeyboardLedState',
                                                            'offset' => '210545',
                                                            'type' => '2501'
                                                          },
                                                  '55' => {
                                                            'name' => 'enableLastRectEncoding',
                                                            'offset' => '210546',
                                                            'type' => '2501'
                                                          },
                                                  '56' => {
                                                            'name' => 'enableCursorShapeUpdates',
                                                            'offset' => '210547',
                                                            'type' => '2501'
                                                          },
                                                  '57' => {
                                                            'name' => 'enableCursorPosUpdates',
                                                            'offset' => '210548',
                                                            'type' => '2501'
                                                          },
                                                  '58' => {
                                                            'name' => 'useRichCursorEncoding',
                                                            'offset' => '210549',
                                                            'type' => '2501'
                                                          },
                                                  '59' => {
                                                            'name' => 'cursorWasChanged',
                                                            'offset' => '210550',
                                                            'type' => '2501'
                                                          },
                                                  '6' => {
                                                           'name' => 'host',
                                                           'offset' => '72',
                                                           'type' => '354'
                                                         },
                                                  '60' => {
                                                            'name' => 'cursorWasMoved',
                                                            'offset' => '210551',
                                                            'type' => '2501'
                                                          },
                                                  '61' => {
                                                            'name' => 'cursorX',
                                                            'offset' => '210560',
                                                            'type' => '240'
                                                          },
                                                  '62' => {
                                                            'name' => 'cursorY',
                                                            'offset' => '210564',
                                                            'type' => '240'
                                                          },
                                                  '63' => {
                                                            'name' => 'useNewFBSize',
                                                            'offset' => '210568',
                                                            'type' => '2501'
                                                          },
                                                  '64' => {
                                                            'name' => 'newFBSizePending',
                                                            'offset' => '210569',
                                                            'type' => '2501'
                                                          },
                                                  '65' => {
                                                            'name' => 'prev',
                                                            'offset' => '210582',
                                                            'type' => '4563'
                                                          },
                                                  '66' => {
                                                            'name' => 'next',
                                                            'offset' => '210692',
                                                            'type' => '4563'
                                                          },
                                                  '67' => {
                                                            'name' => 'refCount',
                                                            'offset' => '210706',
                                                            'type' => '240'
                                                          },
                                                  '68' => {
                                                            'name' => 'refCountMutex',
                                                            'offset' => '210720',
                                                            'type' => '1661'
                                                          },
                                                  '69' => {
                                                            'name' => 'deleteCond',
                                                            'offset' => '210784',
                                                            'type' => '1735'
                                                          },
                                                  '7' => {
                                                           'name' => 'protocolMajorVersion',
                                                           'offset' => '86',
                                                           'type' => '240'
                                                         },
                                                  '70' => {
                                                            'name' => 'outputMutex',
                                                            'offset' => '210952',
                                                            'type' => '1661'
                                                          },
                                                  '71' => {
                                                            'name' => 'updateMutex',
                                                            'offset' => '211016',
                                                            'type' => '1661'
                                                          },
                                                  '72' => {
                                                            'name' => 'updateCond',
                                                            'offset' => '211080',
                                                            'type' => '1735'
                                                          },
                                                  '73' => {
                                                            'name' => 'zrleData',
                                                            'offset' => '211254',
                                                            'type' => '169'
                                                          },
                                                  '74' => {
                                                            'name' => 'zywrleLevel',
                                                            'offset' => '211268',
                                                            'type' => '240'
                                                          },
                                                  '75' => {
                                                            'name' => 'zywrleBuf',
                                                            'offset' => '211272',
                                                            'type' => '9516'
                                                          },
                                                  '76' => {
                                                            'name' => 'progressiveSliceY',
                                                            'offset' => '328498',
                                                            'type' => '240'
                                                          },
                                                  '77' => {
                                                            'name' => 'extensions',
                                                            'offset' => '328502',
                                                            'type' => '9533'
                                                          },
                                                  '78' => {
                                                            'name' => 'zrleBeforeBuf',
                                                            'offset' => '328516',
                                                            'type' => '354'
                                                          },
                                                  '79' => {
                                                            'name' => 'paletteHelper',
                                                            'offset' => '328530',
                                                            'type' => '169'
                                                          },
                                                  '8' => {
                                                           'name' => 'protocolMinorVersion',
                                                           'offset' => '96',
                                                           'type' => '240'
                                                         },
                                                  '80' => {
                                                            'name' => 'sendMutex',
                                                            'offset' => '328544',
                                                            'type' => '1661'
                                                          },
                                                  '81' => {
                                                            'name' => 'beforeEncBuf',
                                                            'offset' => '328704',
                                                            'type' => '354'
                                                          },
                                                  '82' => {
                                                            'name' => 'beforeEncBufSize',
                                                            'offset' => '328712',
                                                            'type' => '240'
                                                          },
                                                  '83' => {
                                                            'name' => 'afterEncBuf',
                                                            'offset' => '328726',
                                                            'type' => '354'
                                                          },
                                                  '84' => {
                                                            'name' => 'afterEncBufSize',
                                                            'offset' => '328740',
                                                            'type' => '240'
                                                          },
                                                  '85' => {
                                                            'name' => 'afterEncBufLen',
                                                            'offset' => '328744',
                                                            'type' => '240'
                                                          },
                                                  '86' => {
                                                            'name' => 'tightEncoding',
                                                            'offset' => '328754',
                                                            'type' => '1794'
                                                          },
                                                  '87' => {
                                                            'name' => 'turboSubsampLevel',
                                                            'offset' => '328758',
                                                            'type' => '240'
                                                          },
                                                  '88' => {
                                                            'name' => 'turboQualityLevel',
                                                            'offset' => '328768',
                                                            'type' => '240'
                                                          },
                                                  '89' => {
                                                            'name' => 'sslctx',
                                                            'offset' => '328776',
                                                            'type' => '9539'
                                                          },
                                                  '9' => {
                                                           'name' => 'client_thread',
                                                           'offset' => '100',
                                                           'type' => '1465'
                                                         },
                                                  '90' => {
                                                            'name' => 'wsctx',
                                                            'offset' => '328790',
                                                            'type' => '9545'
                                                          },
                                                  '91' => {
                                                            'name' => 'wspath',
                                                            'offset' => '328804',
                                                            'type' => '354'
                                                          },
                                                  '92' => {
                                                            'name' => 'pipe_notify_client_thread',
                                                            'offset' => '328818',
                                                            'type' => '290'
                                                          },
                                                  '93' => {
                                                            'name' => 'clientFramebufferUpdateRequestHook',
                                                            'offset' => '328832',
                                                            'type' => '9072'
                                                          },
                                                  '94' => {
                                                            'name' => 'useExtDesktopSize',
                                                            'offset' => '328840',
                                                            'type' => '2501'
                                                          },
                                                  '95' => {
                                                            'name' => 'requestedDesktopSizeChange',
                                                            'offset' => '328850',
                                                            'type' => '240'
                                                          },
                                                  '96' => {
                                                            'name' => 'lastDesktopSizeChangeError',
                                                            'offset' => '328854',
                                                            'type' => '240'
                                                          },
                                                  '97' => {
                                                            'name' => 'enableExtendedClipboard',
                                                            'offset' => '328960',
                                                            'type' => '2501'
                                                          },
                                                  '98' => {
                                                            'name' => 'extClipboardUserCap',
                                                            'offset' => '328964',
                                                            'type' => '1794'
                                                          },
                                                  '99' => {
                                                            'name' => 'extClipboardMaxUnsolicitedSize',
                                                            'offset' => '328968',
                                                            'type' => '1794'
                                                          }
                                                },
                                      'Name' => 'struct _rfbClientRec',
                                      'Size' => '50544',
                                      'Type' => 'Struct'
                                    },
                          '57' => {
                                    'Name' => 'unsigned long',
                                    'Size' => '8',
                                    'Type' => 'Intrinsic'
                                  },
                          '6126' => {
                                      'BaseType' => '6138',
                                      'Header' => 'rfb.h',
                                      'Line' => '104',
                                      'Name' => 'rfbKbdReleaseAllKeysProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6138' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6155' => {
                                      'BaseType' => '6167',
                                      'Header' => 'rfb.h',
                                      'Line' => '105',
                                      'Name' => 'rfbPtrAddEventProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6167' => {
                                      'Name' => 'void(*)(int, int, int, struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '240'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          },
                                                   '2' => {
                                                            'type' => '240'
                                                          },
                                                   '3' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6199' => {
                                      'BaseType' => '6211',
                                      'Header' => 'rfb.h',
                                      'Line' => '106',
                                      'Name' => 'rfbSetXCutTextProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6211' => {
                                      'Name' => 'void(*)(char*, int, struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '354'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          },
                                                   '2' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6238' => {
                                      'BaseType' => '6211',
                                      'Header' => 'rfb.h',
                                      'Line' => '108',
                                      'Name' => 'rfbSetXCutTextUTF8ProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6250' => {
                                      'BaseType' => '6262',
                                      'Header' => 'rfb.h',
                                      'Line' => '110',
                                      'Name' => 'rfbGetCursorProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6262' => {
                                      'Name' => 'struct rfbCursor*(*)(struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '6564',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6268' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '924',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'cleanup',
                                                           'offset' => '0',
                                                           'type' => '2501'
                                                         },
                                                  '1' => {
                                                           'name' => 'cleanupSource',
                                                           'offset' => '1',
                                                           'type' => '2501'
                                                         },
                                                  '10' => {
                                                            'name' => 'foreRed',
                                                            'offset' => '50',
                                                            'type' => '183'
                                                          },
                                                  '11' => {
                                                            'name' => 'foreGreen',
                                                            'offset' => '52',
                                                            'type' => '183'
                                                          },
                                                  '12' => {
                                                            'name' => 'foreBlue',
                                                            'offset' => '54',
                                                            'type' => '183'
                                                          },
                                                  '13' => {
                                                            'name' => 'backRed',
                                                            'offset' => '56',
                                                            'type' => '183'
                                                          },
                                                  '14' => {
                                                            'name' => 'backGreen',
                                                            'offset' => '64',
                                                            'type' => '183'
                                                          },
                                                  '15' => {
                                                            'name' => 'backBlue',
                                                            'offset' => '66',
                                                            'type' => '183'
                                                          },
                                                  '16' => {
                                                            'name' => 'richSource',
                                                            'offset' => '72',
                                                            'type' => '2192'
                                                          },
                                                  '17' => {
                                                            'name' => 'alphaSource',
                                                            'offset' => '86',
                                                            'type' => '2192'
                                                          },
                                                  '18' => {
                                                            'name' => 'alphaPreMultiplied',
                                                            'offset' => '100',
                                                            'type' => '2501'
                                                          },
                                                  '2' => {
                                                           'name' => 'cleanupMask',
                                                           'offset' => '2',
                                                           'type' => '2501'
                                                         },
                                                  '3' => {
                                                           'name' => 'cleanupRichSource',
                                                           'offset' => '3',
                                                           'type' => '2501'
                                                         },
                                                  '4' => {
                                                           'name' => 'source',
                                                           'offset' => '8',
                                                           'type' => '2192'
                                                         },
                                                  '5' => {
                                                           'name' => 'mask',
                                                           'offset' => '22',
                                                           'type' => '2192'
                                                         },
                                                  '6' => {
                                                           'name' => 'width',
                                                           'offset' => '36',
                                                           'type' => '183'
                                                         },
                                                  '7' => {
                                                           'name' => 'height',
                                                           'offset' => '38',
                                                           'type' => '183'
                                                         },
                                                  '8' => {
                                                           'name' => 'xhot',
                                                           'offset' => '40',
                                                           'type' => '183'
                                                         },
                                                  '9' => {
                                                           'name' => 'yhot',
                                                           'offset' => '48',
                                                           'type' => '183'
                                                         }
                                                },
                                      'Name' => 'struct rfbCursor',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '6564' => {
                                      'BaseType' => '6268',
                                      'Name' => 'struct rfbCursor*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6570' => {
                                      'BaseType' => '6582',
                                      'Header' => 'rfb.h',
                                      'Line' => '111',
                                      'Name' => 'rfbSetTranslateFunctionProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6582' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6603' => {
                                      'BaseType' => '6615',
                                      'Header' => 'rfb.h',
                                      'Line' => '112',
                                      'Name' => 'rfbPasswordCheckProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6615' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, char const*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '1759'
                                                          },
                                                   '2' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6646' => {
                                      'BaseType' => '6658',
                                      'Header' => 'rfb.h',
                                      'Line' => '113',
                                      'Name' => 'rfbNewClientHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6658' => {
                                      'Name' => 'enum rfbNewClientAction(*)(struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '4450',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6679' => {
                                      'BaseType' => '6138',
                                      'Header' => 'rfb.h',
                                      'Line' => '114',
                                      'Name' => 'rfbDisplayHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6691' => {
                                      'BaseType' => '6703',
                                      'Header' => 'rfb.h',
                                      'Line' => '115',
                                      'Name' => 'rfbDisplayFinishedHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6703' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6725' => {
                                      'BaseType' => '6737',
                                      'Header' => 'rfb.h',
                                      'Line' => '117',
                                      'Name' => 'rfbGetKeyboardLedStateHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '6737' => {
                                      'Name' => 'int(*)(struct _rfbScreenInfo*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '6758'
                                                          }
                                                 },
                                      'Return' => '240',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '6758' => {
                                      'BaseType' => '6764',
                                      'Name' => 'struct _rfbScreenInfo*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '6764' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '201',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'scaledScreenNext',
                                                           'offset' => '0',
                                                           'type' => '6758'
                                                         },
                                                  '1' => {
                                                           'name' => 'scaledScreenRefCount',
                                                           'offset' => '8',
                                                           'type' => '240'
                                                         },
                                                  '10' => {
                                                            'name' => 'screenData',
                                                            'offset' => '72',
                                                            'type' => '169'
                                                          },
                                                  '11' => {
                                                            'name' => 'serverFormat',
                                                            'offset' => '86',
                                                            'type' => '2703'
                                                          },
                                                  '12' => {
                                                            'name' => 'colourMap',
                                                            'offset' => '114',
                                                            'type' => '8503'
                                                          },
                                                  '13' => {
                                                            'name' => 'desktopName',
                                                            'offset' => '136',
                                                            'type' => '1759'
                                                          },
                                                  '14' => {
                                                            'name' => 'thisHost',
                                                            'offset' => '150',
                                                            'type' => '8928'
                                                          },
                                                  '15' => {
                                                            'name' => 'autoPort',
                                                            'offset' => '849',
                                                            'type' => '2501'
                                                          },
                                                  '16' => {
                                                            'name' => 'port',
                                                            'offset' => '850',
                                                            'type' => '240'
                                                          },
                                                  '17' => {
                                                            'name' => 'listenSock',
                                                            'offset' => '854',
                                                            'type' => '240'
                                                          },
                                                  '18' => {
                                                            'name' => 'maxSock',
                                                            'offset' => '864',
                                                            'type' => '240'
                                                          },
                                                  '19' => {
                                                            'name' => 'maxFd',
                                                            'offset' => '868',
                                                            'type' => '240'
                                                          },
                                                  '2' => {
                                                           'name' => 'width',
                                                           'offset' => '18',
                                                           'type' => '240'
                                                         },
                                                  '20' => {
                                                            'name' => 'allFds',
                                                            'offset' => '872',
                                                            'type' => '1067'
                                                          },
                                                  '21' => {
                                                            'name' => 'socketState',
                                                            'offset' => '1174',
                                                            'type' => '4487'
                                                          },
                                                  '22' => {
                                                            'name' => 'inetdSock',
                                                            'offset' => '1280',
                                                            'type' => '240'
                                                          },
                                                  '23' => {
                                                            'name' => 'inetdInitDone',
                                                            'offset' => '1284',
                                                            'type' => '2501'
                                                          },
                                                  '24' => {
                                                            'name' => 'udpPort',
                                                            'offset' => '1288',
                                                            'type' => '240'
                                                          },
                                                  '25' => {
                                                            'name' => 'udpSock',
                                                            'offset' => '1298',
                                                            'type' => '240'
                                                          },
                                                  '26' => {
                                                            'name' => 'udpClient',
                                                            'offset' => '1312',
                                                            'type' => '4563'
                                                          },
                                                  '27' => {
                                                            'name' => 'udpSockConnected',
                                                            'offset' => '1320',
                                                            'type' => '2501'
                                                          },
                                                  '28' => {
                                                            'name' => 'udpRemoteAddr',
                                                            'offset' => '1330',
                                                            'type' => '2419'
                                                          },
                                                  '29' => {
                                                            'name' => 'maxClientWait',
                                                            'offset' => '1352',
                                                            'type' => '240'
                                                          },
                                                  '3' => {
                                                           'name' => 'paddedWidthInBytes',
                                                           'offset' => '22',
                                                           'type' => '240'
                                                         },
                                                  '30' => {
                                                            'name' => 'httpInitDone',
                                                            'offset' => '1362',
                                                            'type' => '2501'
                                                          },
                                                  '31' => {
                                                            'name' => 'httpEnableProxyConnect',
                                                            'offset' => '1363',
                                                            'type' => '2501'
                                                          },
                                                  '32' => {
                                                            'name' => 'httpPort',
                                                            'offset' => '1366',
                                                            'type' => '240'
                                                          },
                                                  '33' => {
                                                            'name' => 'httpDir',
                                                            'offset' => '1376',
                                                            'type' => '354'
                                                          },
                                                  '34' => {
                                                            'name' => 'httpListenSock',
                                                            'offset' => '1384',
                                                            'type' => '240'
                                                          },
                                                  '35' => {
                                                            'name' => 'httpSock',
                                                            'offset' => '1394',
                                                            'type' => '240'
                                                          },
                                                  '36' => {
                                                            'name' => 'passwordCheck',
                                                            'offset' => '1398',
                                                            'type' => '6603'
                                                          },
                                                  '37' => {
                                                            'name' => 'authPasswdData',
                                                            'offset' => '1412',
                                                            'type' => '169'
                                                          },
                                                  '38' => {
                                                            'name' => 'authPasswdFirstViewOnly',
                                                            'offset' => '1426',
                                                            'type' => '240'
                                                          },
                                                  '39' => {
                                                            'name' => 'maxRectsPerUpdate',
                                                            'offset' => '1430',
                                                            'type' => '240'
                                                          },
                                                  '4' => {
                                                           'name' => 'height',
                                                           'offset' => '32',
                                                           'type' => '240'
                                                         },
                                                  '40' => {
                                                            'name' => 'deferUpdateTime',
                                                            'offset' => '1536',
                                                            'type' => '240'
                                                          },
                                                  '41' => {
                                                            'name' => 'alwaysShared',
                                                            'offset' => '1540',
                                                            'type' => '2501'
                                                          },
                                                  '42' => {
                                                            'name' => 'neverShared',
                                                            'offset' => '1541',
                                                            'type' => '2501'
                                                          },
                                                  '43' => {
                                                            'name' => 'dontDisconnect',
                                                            'offset' => '1542',
                                                            'type' => '2501'
                                                          },
                                                  '44' => {
                                                            'name' => 'clientHead',
                                                            'offset' => '1544',
                                                            'type' => '4563'
                                                          },
                                                  '45' => {
                                                            'name' => 'pointerClient',
                                                            'offset' => '1558',
                                                            'type' => '4563'
                                                          },
                                                  '46' => {
                                                            'name' => 'cursorX',
                                                            'offset' => '1572',
                                                            'type' => '240'
                                                          },
                                                  '47' => {
                                                            'name' => 'cursorY',
                                                            'offset' => '1576',
                                                            'type' => '240'
                                                          },
                                                  '48' => {
                                                            'name' => 'underCursorBufferLen',
                                                            'offset' => '1586',
                                                            'type' => '240'
                                                          },
                                                  '49' => {
                                                            'name' => 'underCursorBuffer',
                                                            'offset' => '1600',
                                                            'type' => '354'
                                                          },
                                                  '5' => {
                                                           'name' => 'depth',
                                                           'offset' => '36',
                                                           'type' => '240'
                                                         },
                                                  '50' => {
                                                            'name' => 'dontConvertRichCursorToXCursor',
                                                            'offset' => '1608',
                                                            'type' => '2501'
                                                          },
                                                  '51' => {
                                                            'name' => 'cursor',
                                                            'offset' => '1622',
                                                            'type' => '6564'
                                                          },
                                                  '52' => {
                                                            'name' => 'frameBuffer',
                                                            'offset' => '1636',
                                                            'type' => '354'
                                                          },
                                                  '53' => {
                                                            'name' => 'kbdAddEvent',
                                                            'offset' => '1650',
                                                            'type' => '4524'
                                                          },
                                                  '54' => {
                                                            'name' => 'kbdReleaseAllKeys',
                                                            'offset' => '1664',
                                                            'type' => '6126'
                                                          },
                                                  '55' => {
                                                            'name' => 'ptrAddEvent',
                                                            'offset' => '1672',
                                                            'type' => '6155'
                                                          },
                                                  '56' => {
                                                            'name' => 'setXCutText',
                                                            'offset' => '1686',
                                                            'type' => '6199'
                                                          },
                                                  '57' => {
                                                            'name' => 'getCursorPtr',
                                                            'offset' => '1796',
                                                            'type' => '6250'
                                                          },
                                                  '58' => {
                                                            'name' => 'setTranslateFunction',
                                                            'offset' => '1810',
                                                            'type' => '6570'
                                                          },
                                                  '59' => {
                                                            'name' => 'setSingleWindow',
                                                            'offset' => '1824',
                                                            'type' => '8306'
                                                          },
                                                  '6' => {
                                                           'name' => 'bitsPerPixel',
                                                           'offset' => '40',
                                                           'type' => '240'
                                                         },
                                                  '60' => {
                                                            'name' => 'setServerInput',
                                                            'offset' => '1832',
                                                            'type' => '8345'
                                                          },
                                                  '61' => {
                                                            'name' => 'getFileTransferPermission',
                                                            'offset' => '1846',
                                                            'type' => '8357'
                                                          },
                                                  '62' => {
                                                            'name' => 'setTextChat',
                                                            'offset' => '1860',
                                                            'type' => '8369'
                                                          },
                                                  '63' => {
                                                            'name' => 'newClientHook',
                                                            'offset' => '1874',
                                                            'type' => '6646'
                                                          },
                                                  '64' => {
                                                            'name' => 'displayHook',
                                                            'offset' => '1888',
                                                            'type' => '6679'
                                                          },
                                                  '65' => {
                                                            'name' => 'getKeyboardLedStateHook',
                                                            'offset' => '1896',
                                                            'type' => '6725'
                                                          },
                                                  '66' => {
                                                            'name' => 'cursorMutex',
                                                            'offset' => '1910',
                                                            'type' => '1661'
                                                          },
                                                  '67' => {
                                                            'name' => 'backgroundLoop',
                                                            'offset' => '2070',
                                                            'type' => '2501'
                                                          },
                                                  '68' => {
                                                            'name' => 'ignoreSIGPIPE',
                                                            'offset' => '2071',
                                                            'type' => '2501'
                                                          },
                                                  '69' => {
                                                            'name' => 'progressiveSliceHeight',
                                                            'offset' => '2080',
                                                            'type' => '240'
                                                          },
                                                  '7' => {
                                                           'name' => 'sizeInBytes',
                                                           'offset' => '50',
                                                           'type' => '240'
                                                         },
                                                  '70' => {
                                                            'name' => 'listenInterface',
                                                            'offset' => '2084',
                                                            'type' => '2352'
                                                          },
                                                  '71' => {
                                                            'name' => 'deferPtrUpdateTime',
                                                            'offset' => '2088',
                                                            'type' => '240'
                                                          },
                                                  '72' => {
                                                            'name' => 'handleEventsEagerly',
                                                            'offset' => '2098',
                                                            'type' => '2501'
                                                          },
                                                  '73' => {
                                                            'name' => 'versionString',
                                                            'offset' => '2112',
                                                            'type' => '354'
                                                          },
                                                  '74' => {
                                                            'name' => 'protocolMajorVersion',
                                                            'offset' => '2120',
                                                            'type' => '240'
                                                          },
                                                  '75' => {
                                                            'name' => 'protocolMinorVersion',
                                                            'offset' => '2130',
                                                            'type' => '240'
                                                          },
                                                  '76' => {
                                                            'name' => 'permitFileTransfer',
                                                            'offset' => '2134',
                                                            'type' => '2501'
                                                          },
                                                  '77' => {
                                                            'name' => 'displayFinishedHook',
                                                            'offset' => '2148',
                                                            'type' => '6691'
                                                          },
                                                  '78' => {
                                                            'name' => 'xvpHook',
                                                            'offset' => '2162',
                                                            'type' => '8128'
                                                          },
                                                  '79' => {
                                                            'name' => 'sslkeyfile',
                                                            'offset' => '2176',
                                                            'type' => '354'
                                                          },
                                                  '8' => {
                                                           'name' => 'blackPixel',
                                                           'offset' => '54',
                                                           'type' => '2525'
                                                         },
                                                  '80' => {
                                                            'name' => 'sslcertfile',
                                                            'offset' => '2184',
                                                            'type' => '354'
                                                          },
                                                  '81' => {
                                                            'name' => 'ipv6port',
                                                            'offset' => '2198',
                                                            'type' => '240'
                                                          },
                                                  '82' => {
                                                            'name' => 'listen6Interface',
                                                            'offset' => '2308',
                                                            'type' => '354'
                                                          },
                                                  '83' => {
                                                            'name' => 'listen6Sock',
                                                            'offset' => '2322',
                                                            'type' => '240'
                                                          },
                                                  '84' => {
                                                            'name' => 'http6Port',
                                                            'offset' => '2326',
                                                            'type' => '240'
                                                          },
                                                  '85' => {
                                                            'name' => 'httpListen6Sock',
                                                            'offset' => '2336',
                                                            'type' => '240'
                                                          },
                                                  '86' => {
                                                            'name' => 'setDesktopSizeHook',
                                                            'offset' => '2344',
                                                            'type' => '8171'
                                                          },
                                                  '87' => {
                                                            'name' => 'numberOfExtDesktopScreensHook',
                                                            'offset' => '2358',
                                                            'type' => '8230'
                                                          },
                                                  '88' => {
                                                            'name' => 'getExtDesktopScreenHook',
                                                            'offset' => '2372',
                                                            'type' => '8263'
                                                          },
                                                  '89' => {
                                                            'name' => 'fdQuota',
                                                            'offset' => '2386',
                                                            'type' => '8944'
                                                          },
                                                  '9' => {
                                                           'name' => 'whitePixel',
                                                           'offset' => '64',
                                                           'type' => '2525'
                                                         },
                                                  '90' => {
                                                            'name' => 'listener_thread',
                                                            'offset' => '2400',
                                                            'type' => '1465'
                                                          },
                                                  '91' => {
                                                            'name' => 'pipe_notify_listener_thread',
                                                            'offset' => '2408',
                                                            'type' => '290'
                                                          },
                                                  '92' => {
                                                            'name' => 'setXCutTextUTF8',
                                                            'offset' => '2422',
                                                            'type' => '6238'
                                                          }
                                                },
                                      'Name' => 'struct _rfbScreenInfo',
                                      'Size' => '984',
                                      'Type' => 'Struct'
                                    },
                          '76863' => {
                                       'BaseType' => '9854',
                                       'Line' => '21',
                                       'Name' => 'sraSpan',
                                       'PrivateABI' => 1,
                                       'Size' => '32',
                                       'Source' => 'rfbregion.c',
                                       'Type' => 'Typedef'
                                     },
                          '8128' => {
                                      'BaseType' => '8140',
                                      'Header' => 'rfb.h',
                                      'Line' => '118',
                                      'Name' => 'rfbXvpHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8140' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, uint8_t, uint8_t)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '1770'
                                                          },
                                                   '2' => {
                                                            'type' => '1770'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8171' => {
                                      'BaseType' => '8183',
                                      'Header' => 'rfb.h',
                                      'Line' => '119',
                                      'Name' => 'rfbSetDesktopSizeHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8183' => {
                                      'Name' => 'int(*)(int, int, int, struct rfbExtDesktopScreen*, struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '240'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          },
                                                   '2' => {
                                                            'type' => '240'
                                                          },
                                                   '3' => {
                                                            'type' => '8224'
                                                          },
                                                   '4' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '240',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8224' => {
                                      'BaseType' => '2991',
                                      'Name' => 'struct rfbExtDesktopScreen*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8230' => {
                                      'BaseType' => '8242',
                                      'Header' => 'rfb.h',
                                      'Line' => '120',
                                      'Name' => 'rfbNumberOfExtDesktopScreensPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8242' => {
                                      'Name' => 'int(*)(struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '240',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8263' => {
                                      'BaseType' => '8275',
                                      'Header' => 'rfb.h',
                                      'Line' => '121',
                                      'Name' => 'rfbGetExtDesktopScreenPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8275' => {
                                      'Name' => 'rfbBool(*)(int, struct rfbExtDesktopScreen*, struct _rfbClientRec*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '240'
                                                          },
                                                   '1' => {
                                                            'type' => '8224'
                                                          },
                                                   '2' => {
                                                            'type' => '4563'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8306' => {
                                      'BaseType' => '8318',
                                      'Header' => 'rfb.h',
                                      'Line' => '127',
                                      'Name' => 'rfbSetSingleWindowProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8318' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          },
                                                   '2' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8345' => {
                                      'BaseType' => '6703',
                                      'Header' => 'rfb.h',
                                      'Line' => '132',
                                      'Name' => 'rfbSetServerInputProcPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8357' => {
                                      'BaseType' => '8242',
                                      'Header' => 'rfb.h',
                                      'Line' => '137',
                                      'Name' => 'rfbFileTransferPermitted',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8369' => {
                                      'BaseType' => '8381',
                                      'Header' => 'rfb.h',
                                      'Line' => '139',
                                      'Name' => 'rfbSetTextChat',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8381' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*, int, char*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '240'
                                                          },
                                                   '2' => {
                                                            'type' => '354'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8408' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '144',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'bytes',
                                                           'offset' => '0',
                                                           'type' => '8442'
                                                         },
                                                  '1' => {
                                                           'name' => 'shorts',
                                                           'offset' => '0',
                                                           'type' => '8448'
                                                         }
                                                },
                                      'Name' => 'anon-union-rfb.h-144',
                                      'Size' => '8',
                                      'Type' => 'Union'
                                    },
                          '8442' => {
                                      'BaseType' => '1770',
                                      'Name' => 'uint8_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8448' => {
                                      'BaseType' => '1782',
                                      'Name' => 'uint16_t*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8503' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '148',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'count',
                                                           'offset' => '0',
                                                           'type' => '1794'
                                                         },
                                                  '1' => {
                                                           'name' => 'is16',
                                                           'offset' => '4',
                                                           'type' => '2501'
                                                         },
                                                  '2' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '8408'
                                                         }
                                                },
                                      'Name' => 'struct rfbColourMap',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '8515' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '164',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'newClient',
                                                           'offset' => '0',
                                                           'type' => '8672'
                                                         },
                                                  '1' => {
                                                           'name' => 'init',
                                                           'offset' => '8',
                                                           'type' => '8698'
                                                         },
                                                  '2' => {
                                                           'name' => 'pseudoEncodings',
                                                           'offset' => '22',
                                                           'type' => '8704'
                                                         },
                                                  '3' => {
                                                           'name' => 'enablePseudoEncoding',
                                                           'offset' => '36',
                                                           'type' => '8735'
                                                         },
                                                  '4' => {
                                                           'name' => 'handleMessage',
                                                           'offset' => '50',
                                                           'type' => '8772'
                                                         },
                                                  '5' => {
                                                           'name' => 'close',
                                                           'offset' => '64',
                                                           'type' => '8794'
                                                         },
                                                  '6' => {
                                                           'name' => 'usage',
                                                           'offset' => '72',
                                                           'type' => '8801'
                                                         },
                                                  '7' => {
                                                           'name' => 'processArgument',
                                                           'offset' => '86',
                                                           'type' => '8827'
                                                         },
                                                  '8' => {
                                                           'name' => 'next',
                                                           'offset' => '100',
                                                           'type' => '8833'
                                                         }
                                                },
                                      'Name' => 'struct _rfbProtocolExtension',
                                      'Size' => '72',
                                      'Type' => 'Struct'
                                    },
                          '8666' => {
                                      'BaseType' => '169',
                                      'Name' => 'void**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8672' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, void**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '8666'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8698' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '169'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8704' => {
                                      'BaseType' => '240',
                                      'Name' => 'int*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8735' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, void**, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '8666'
                                                          },
                                                   '2' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8766' => {
                                      'BaseType' => '4284',
                                      'Name' => 'rfbClientToServerMsg const*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8772' => {
                                      'Name' => 'rfbBool(*)(struct _rfbClientRec*, void*, rfbClientToServerMsg const*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '169'
                                                          },
                                                   '2' => {
                                                            'type' => '8766'
                                                          }
                                                 },
                                      'Return' => '2501',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8794' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*, void*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '169'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8801' => {
                                      'Name' => 'void(*)()',
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8827' => {
                                      'Name' => 'int(*)(int, char**)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '240'
                                                          },
                                                   '1' => {
                                                            'type' => '1884'
                                                          }
                                                 },
                                      'Return' => '240',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '8833' => {
                                      'BaseType' => '8515',
                                      'Name' => 'struct _rfbProtocolExtension*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8839' => {
                                      'BaseType' => '8515',
                                      'Header' => 'rfb.h',
                                      'Line' => '187',
                                      'Name' => 'rfbProtocolExtension',
                                      'Size' => '72',
                                      'Type' => 'Typedef'
                                    },
                          '8851' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '189',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'extension',
                                                           'offset' => '0',
                                                           'type' => '8904'
                                                         },
                                                  '1' => {
                                                           'name' => 'data',
                                                           'offset' => '8',
                                                           'type' => '169'
                                                         },
                                                  '2' => {
                                                           'name' => 'next',
                                                           'offset' => '22',
                                                           'type' => '8910'
                                                         }
                                                },
                                      'Name' => 'struct _rfbExtensionData',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '8904' => {
                                      'BaseType' => '8839',
                                      'Name' => 'rfbProtocolExtension*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8910' => {
                                      'BaseType' => '8851',
                                      'Name' => 'struct _rfbExtensionData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '8916' => {
                                      'BaseType' => '8851',
                                      'Header' => 'rfb.h',
                                      'Line' => '193',
                                      'Name' => 'rfbExtensionData',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '8928' => {
                                      'BaseType' => '365',
                                      'Name' => 'char[255]',
                                      'Size' => '255',
                                      'Type' => 'Array'
                                    },
                          '8944' => {
                                      'Name' => 'float',
                                      'Size' => '4',
                                      'Type' => 'Intrinsic'
                                    },
                          '8951' => {
                                      'BaseType' => '6758',
                                      'Header' => 'rfb.h',
                                      'Line' => '375',
                                      'Name' => 'rfbScreenInfoPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8964' => {
                                      'BaseType' => '8977',
                                      'Header' => 'rfb.h',
                                      'Line' => '382',
                                      'Name' => 'rfbTranslateFnType',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '8977' => {
                                      'Name' => 'void(*)(char*, rfbPixelFormat*, rfbPixelFormat*, char*, char*, int, int, int)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '354'
                                                          },
                                                   '1' => {
                                                            'type' => '9029'
                                                          },
                                                   '2' => {
                                                            'type' => '9029'
                                                          },
                                                   '3' => {
                                                            'type' => '354'
                                                          },
                                                   '4' => {
                                                            'type' => '354'
                                                          },
                                                   '5' => {
                                                            'type' => '240'
                                                          },
                                                   '6' => {
                                                            'type' => '240'
                                                          },
                                                   '7' => {
                                                            'type' => '240'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9029' => {
                                      'BaseType' => '2703',
                                      'Name' => 'rfbPixelFormat*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9035' => {
                                      'BaseType' => '9048',
                                      'Header' => 'rfb.h',
                                      'Line' => '392',
                                      'Name' => 'sraRegionPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9048' => {
                                      'BaseType' => '9054',
                                      'Name' => 'struct sraRegion*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9054' => {
                                      'Line' => '23',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'front',
                                                           'offset' => '0',
                                                           'type' => '76863'
                                                         },
                                                  '1' => {
                                                           'name' => 'back',
                                                           'offset' => '50',
                                                           'type' => '76863'
                                                         }
                                                },
                                      'Name' => 'struct sraRegion',
                                      'PrivateABI' => 1,
                                      'Size' => '64',
                                      'Source' => 'rfbregion.c',
                                      'Type' => 'Struct'
                                    },
                          '9059' => {
                                      'BaseType' => '6138',
                                      'Header' => 'rfb.h',
                                      'Line' => '398',
                                      'Name' => 'ClientGoneHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '90716' => {
                                       'Header' => 'rfb.h',
                                       'Line' => '154',
                                       'Memb' => {
                                                   '0' => {
                                                            'name' => 'type',
                                                            'offset' => '0',
                                                            'type' => '1770'
                                                          },
                                                   '1' => {
                                                            'name' => 'handler',
                                                            'offset' => '8',
                                                            'type' => '6138'
                                                          },
                                                   '2' => {
                                                            'name' => 'next',
                                                            'offset' => '22',
                                                            'type' => '90769'
                                                          }
                                                 },
                                       'Name' => 'struct _rfbSecurity',
                                       'Size' => '24',
                                       'Type' => 'Struct'
                                     },
                          '9072' => {
                                      'BaseType' => '9085',
                                      'Header' => 'rfb.h',
                                      'Line' => '399',
                                      'Name' => 'ClientFramebufferUpdateRequestHookPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '90769' => {
                                       'BaseType' => '90716',
                                       'Name' => 'struct _rfbSecurity*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '90775' => {
                                       'BaseType' => '90716',
                                       'Header' => 'rfb.h',
                                       'Line' => '158',
                                       'Name' => 'rfbSecurityHandler',
                                       'Size' => '24',
                                       'Type' => 'Typedef'
                                     },
                          '9085' => {
                                      'Name' => 'void(*)(struct _rfbClientRec*, rfbFramebufferUpdateRequestMsg*)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '4563'
                                                          },
                                                   '1' => {
                                                            'type' => '9107'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9107' => {
                                      'BaseType' => '3523',
                                      'Name' => 'rfbFramebufferUpdateRequestMsg*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9113' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '401',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'fd',
                                                           'offset' => '0',
                                                           'type' => '240'
                                                         },
                                                  '1' => {
                                                           'name' => 'compressionEnabled',
                                                           'offset' => '4',
                                                           'type' => '240'
                                                         },
                                                  '2' => {
                                                           'name' => 'fileSize',
                                                           'offset' => '8',
                                                           'type' => '240'
                                                         },
                                                  '3' => {
                                                           'name' => 'numPackets',
                                                           'offset' => '18',
                                                           'type' => '240'
                                                         },
                                                  '4' => {
                                                           'name' => 'receiving',
                                                           'offset' => '22',
                                                           'type' => '240'
                                                         },
                                                  '5' => {
                                                           'name' => 'sending',
                                                           'offset' => '32',
                                                           'type' => '240'
                                                         }
                                                },
                                      'Name' => 'struct _rfbFileTransferData',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '91928' => {
                                       'BaseType' => '90775',
                                       'Name' => 'rfbSecurityHandler*',
                                       'Size' => '8',
                                       'Type' => 'Pointer'
                                     },
                          '9211' => {
                                      'BaseType' => '9113',
                                      'Header' => 'rfb.h',
                                      'Line' => '408',
                                      'Name' => 'rfbFileTransferData',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    },
                          '9224' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '411',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'type',
                                                           'offset' => '0',
                                                           'type' => '1794'
                                                         },
                                                  '1' => {
                                                           'name' => 'sentCount',
                                                           'offset' => '4',
                                                           'type' => '1794'
                                                         },
                                                  '2' => {
                                                           'name' => 'bytesSent',
                                                           'offset' => '8',
                                                           'type' => '1794'
                                                         },
                                                  '3' => {
                                                           'name' => 'bytesSentIfRaw',
                                                           'offset' => '18',
                                                           'type' => '1794'
                                                         },
                                                  '4' => {
                                                           'name' => 'rcvdCount',
                                                           'offset' => '22',
                                                           'type' => '1794'
                                                         },
                                                  '5' => {
                                                           'name' => 'bytesRcvd',
                                                           'offset' => '32',
                                                           'type' => '1794'
                                                         },
                                                  '6' => {
                                                           'name' => 'bytesRcvdIfRaw',
                                                           'offset' => '36',
                                                           'type' => '1794'
                                                         },
                                                  '7' => {
                                                           'name' => 'Next',
                                                           'offset' => '50',
                                                           'type' => '9351'
                                                         }
                                                },
                                      'Name' => 'struct _rfbStatList',
                                      'Size' => '40',
                                      'Type' => 'Struct'
                                    },
                          '9351' => {
                                      'BaseType' => '9224',
                                      'Name' => 'struct _rfbStatList*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9357' => {
                                      'BaseType' => '9370',
                                      'Header' => 'rfb.h',
                                      'Line' => '422',
                                      'Name' => 'rfbSslCtx',
                                      'Type' => 'Typedef'
                                    },
                          '9370' => {
                                      'Name' => 'struct _rfbSslCtx',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '9375' => {
                                      'BaseType' => '9388',
                                      'Header' => 'rfb.h',
                                      'Line' => '423',
                                      'Name' => 'wsCtx',
                                      'Type' => 'Typedef'
                                    },
                          '9388' => {
                                      'Name' => 'struct _wsCtx',
                                      'PrivateABI' => 1,
                                      'Type' => 'Struct'
                                    },
                          '9393' => {
                                      'Header' => 'rfb.h',
                                      'Line' => '484',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'RFB_PROTOCOL_VERSION',
                                                           'value' => '0'
                                                         },
                                                  '1' => {
                                                           'name' => 'RFB_SECURITY_TYPE',
                                                           'value' => '1'
                                                         },
                                                  '2' => {
                                                           'name' => 'RFB_AUTHENTICATION',
                                                           'value' => '2'
                                                         },
                                                  '3' => {
                                                           'name' => 'RFB_INITIALISATION',
                                                           'value' => '3'
                                                         },
                                                  '4' => {
                                                           'name' => 'RFB_NORMAL',
                                                           'value' => '4'
                                                         },
                                                  '5' => {
                                                           'name' => 'RFB_INITIALISATION_SHARED',
                                                           'value' => '5'
                                                         },
                                                  '6' => {
                                                           'name' => 'RFB_SHUTDOWN',
                                                           'value' => '6'
                                                         }
                                                },
                                      'Name' => 'anon-enum-rfb.h-484',
                                      'Size' => '4',
                                      'Type' => 'Enum'
                                    },
                          '940' => {
                                     'Name' => 'long long',
                                     'Size' => '8',
                                     'Type' => 'Intrinsic'
                                   },
                          '9451' => {
                                      'BaseType' => '365',
                                      'Name' => 'char[32768]',
                                      'Size' => '32768',
                                      'Type' => 'Array'
                                    },
                          '9468' => {
                                      'BaseType' => '2180',
                                      'Name' => 'z_stream[4]',
                                      'Size' => '448',
                                      'Type' => 'Array'
                                    },
                          '9484' => {
                                      'BaseType' => '2501',
                                      'Name' => 'rfbBool[4]',
                                      'Size' => '4',
                                      'Type' => 'Array'
                                    },
                          '9500' => {
                                      'BaseType' => '240',
                                      'Name' => 'int[4]',
                                      'Size' => '16',
                                      'Type' => 'Array'
                                    },
                          '9516' => {
                                      'BaseType' => '240',
                                      'Name' => 'int[4096]',
                                      'Size' => '16384',
                                      'Type' => 'Array'
                                    },
                          '9533' => {
                                      'BaseType' => '8916',
                                      'Name' => 'rfbExtensionData*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9539' => {
                                      'BaseType' => '9357',
                                      'Name' => 'rfbSslCtx*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9545' => {
                                      'BaseType' => '9375',
                                      'Name' => 'wsCtx*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9551' => {
                                      'BaseType' => '4563',
                                      'Header' => 'rfb.h',
                                      'Line' => '710',
                                      'Name' => 'rfbClientPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9577' => {
                                      'BaseType' => '9590',
                                      'Header' => 'rfb.h',
                                      'Line' => '787',
                                      'Name' => 'rfbClientIteratorPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9590' => {
                                      'BaseType' => '9596',
                                      'Name' => 'struct rfbClientIterator*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9596' => {
                                      'Line' => '147',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'next',
                                                           'offset' => '0',
                                                           'type' => '9551'
                                                         },
                                                  '1' => {
                                                           'name' => 'screen',
                                                           'offset' => '8',
                                                           'type' => '8951'
                                                         },
                                                  '2' => {
                                                           'name' => 'closedToo',
                                                           'offset' => '22',
                                                           'type' => '2501'
                                                         }
                                                },
                                      'Name' => 'struct rfbClientIterator',
                                      'PrivateABI' => 1,
                                      'Size' => '24',
                                      'Source' => 'rfbserver.c',
                                      'Type' => 'Struct'
                                    },
                          '9614' => {
                                      'BaseType' => '6564',
                                      'Header' => 'rfb.h',
                                      'Line' => '935',
                                      'Name' => 'rfbCursorPtr',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '9627' => {
                                      'BaseType' => '9640',
                                      'Header' => 'rfb.h',
                                      'Line' => '1019',
                                      'Name' => 'rfbLogProc',
                                      'Size' => '8',
                                      'Type' => 'Typedef'
                                    },
                          '964' => {
                                     'BaseType' => '190',
                                     'Header' => 'stdint-intn.h',
                                     'Line' => '24',
                                     'Name' => 'int8_t',
                                     'PrivateABI' => 1,
                                     'Size' => '1',
                                     'Type' => 'Typedef'
                                   },
                          '9640' => {
                                      'Name' => 'void(*)(char const*, ...)',
                                      'Param' => {
                                                   '0' => {
                                                            'type' => '1759'
                                                          },
                                                   '1' => {
                                                            'type' => '-1'
                                                          }
                                                 },
                                      'Return' => '1',
                                      'Size' => '8',
                                      'Type' => 'FuncPtr'
                                    },
                          '9684' => {
                                      'Header' => 'rfbregion.h',
                                      'Line' => '11',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'x1',
                                                           'offset' => '0',
                                                           'type' => '240'
                                                         },
                                                  '1' => {
                                                           'name' => 'y1',
                                                           'offset' => '4',
                                                           'type' => '240'
                                                         },
                                                  '2' => {
                                                           'name' => 'x2',
                                                           'offset' => '8',
                                                           'type' => '240'
                                                         },
                                                  '3' => {
                                                           'name' => 'y2',
                                                           'offset' => '18',
                                                           'type' => '240'
                                                         }
                                                },
                                      'Name' => 'struct _rect',
                                      'Size' => '16',
                                      'Type' => 'Struct'
                                    },
                          '9746' => {
                                      'BaseType' => '9684',
                                      'Header' => 'rfbregion.h',
                                      'Line' => '16',
                                      'Name' => 'sraRect',
                                      'Size' => '16',
                                      'Type' => 'Typedef'
                                    },
                          '9758' => {
                                      'BaseType' => '9054',
                                      'Header' => 'rfbregion.h',
                                      'Line' => '18',
                                      'Name' => 'sraRegion',
                                      'Type' => 'Typedef'
                                    },
                          '976' => {
                                     'Header' => 'struct_timeval.h',
                                     'Line' => '8',
                                     'Memb' => {
                                                 '0' => {
                                                          'name' => 'tv_sec',
                                                          'offset' => '0',
                                                          'type' => '306'
                                                        },
                                                 '1' => {
                                                          'name' => 'tv_usec',
                                                          'offset' => '8',
                                                          'type' => '330'
                                                        }
                                               },
                                     'Name' => 'struct timeval',
                                     'PrivateABI' => 1,
                                     'Size' => '16',
                                     'Type' => 'Struct'
                                   },
                          '9770' => {
                                      'BaseType' => '9758',
                                      'Name' => 'sraRegion const',
                                      'Type' => 'Const'
                                    },
                          '9775' => {
                                      'Header' => 'rfbregion.h',
                                      'Line' => '44',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => 'reverseX',
                                                           'offset' => '0',
                                                           'type' => '2501'
                                                         },
                                                  '1' => {
                                                           'name' => 'reverseY',
                                                           'offset' => '1',
                                                           'type' => '2501'
                                                         },
                                                  '2' => {
                                                           'name' => 'ptrSize',
                                                           'offset' => '4',
                                                           'type' => '240'
                                                         },
                                                  '3' => {
                                                           'name' => 'ptrPos',
                                                           'offset' => '8',
                                                           'type' => '240'
                                                         },
                                                  '4' => {
                                                           'name' => 'sPtrs',
                                                           'offset' => '22',
                                                           'type' => '9859'
                                                         }
                                                },
                                      'Name' => 'struct sraRectangleIterator',
                                      'Size' => '24',
                                      'Type' => 'Struct'
                                    },
                          '9854' => {
                                      'Line' => '15',
                                      'Memb' => {
                                                  '0' => {
                                                           'name' => '_next',
                                                           'offset' => '0',
                                                           'type' => '9865'
                                                         },
                                                  '1' => {
                                                           'name' => '_prev',
                                                           'offset' => '8',
                                                           'type' => '9865'
                                                         },
                                                  '2' => {
                                                           'name' => 'start',
                                                           'offset' => '22',
                                                           'type' => '240'
                                                         },
                                                  '3' => {
                                                           'name' => 'end',
                                                           'offset' => '32',
                                                           'type' => '240'
                                                         },
                                                  '4' => {
                                                           'name' => 'subspan',
                                                           'offset' => '36',
                                                           'type' => '9048'
                                                         }
                                                },
                                      'Name' => 'struct sraSpan',
                                      'PrivateABI' => 1,
                                      'Size' => '32',
                                      'Source' => 'rfbregion.c',
                                      'Type' => 'Struct'
                                    },
                          '9859' => {
                                      'BaseType' => '9865',
                                      'Name' => 'struct sraSpan**',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9865' => {
                                      'BaseType' => '9854',
                                      'Name' => 'struct sraSpan*',
                                      'Size' => '8',
                                      'Type' => 'Pointer'
                                    },
                          '9871' => {
                                      'BaseType' => '9775',
                                      'Header' => 'rfbregion.h',
                                      'Line' => '48',
                                      'Name' => 'sraRectangleIterator',
                                      'Size' => '24',
                                      'Type' => 'Typedef'
                                    }
                        },
          'UndefinedSymbols' => {
                                  'libvncserver.so.0.9.14' => {
                                                                '_ITM_deregisterTMCloneTable' => 0,
                                                                '_ITM_registerTMCloneTable' => 0,
                                                                '__assert_fail@GLIBC_2.2.5' => 0,
                                                                '__ctype_b_loc@GLIBC_2.3' => 0,
                                                                '__ctype_tolower_loc@GLIBC_2.3' => 0,
                                                                '__cxa_finalize@GLIBC_2.2.5' => 0,
                                                                '__errno_location@GLIBC_2.2.5' => 0,
                                                                '__fdelt_chk@GLIBC_2.15' => 0,
                                                                '__fread_chk@GLIBC_2.7' => 0,
                                                                '__gethostname_chk@GLIBC_2.4' => 0,
                                                                '__gmon_start__' => 0,
                                                                '__isoc99_sscanf@GLIBC_2.7' => 0,
                                                                '__longjmp_chk@GLIBC_2.11' => 0,
                                                                '__memcpy_chk@GLIBC_2.3.4' => 0,
                                                                '__printf_chk@GLIBC_2.3.4' => 0,
                                                                '__read_chk@GLIBC_2.4' => 0,
                                                                '__recv_chk@GLIBC_2.4' => 0,
                                                                '__snprintf_chk@GLIBC_2.3.4' => 0,
                                                                '__sprintf_chk@GLIBC_2.3.4' => 0,
                                                                '__stack_chk_fail@GLIBC_2.4' => 0,
                                                                '__strcat_chk@GLIBC_2.3.4' => 0,
                                                                '__strcpy_chk@GLIBC_2.3.4' => 0,
                                                                '__vfprintf_chk@GLIBC_2.3.4' => 0,
                                                                '__vsnprintf_chk@GLIBC_2.3.4' => 0,
                                                                '_setjmp@GLIBC_2.2.5' => 0,
                                                                'accept@GLIBC_2.2.5' => 0,
                                                                'bind@GLIBC_2.2.5' => 0,
                                                                'calloc@GLIBC_2.2.5' => 0,
                                                                'close@GLIBC_2.2.5' => 0,
                                                                'closedir@GLIBC_2.2.5' => 0,
                                                                'compress' => 0,
                                                                'compressBound@ZLIB_1.2.0' => 0,
                                                                'connect@GLIBC_2.2.5' => 0,
                                                                'creat@GLIBC_2.2.5' => 0,
                                                                'deflate' => 0,
                                                                'deflateEnd' => 0,
                                                                'deflateInit2_' => 0,
                                                                'deflateInit_' => 0,
                                                                'deflateParams' => 0,
                                                                'fchmod@GLIBC_2.2.5' => 0,
                                                                'fclose@GLIBC_2.2.5' => 0,
                                                                'fcntl@GLIBC_2.2.5' => 0,
                                                                'fflush@GLIBC_2.2.5' => 0,
                                                                'fileno@GLIBC_2.2.5' => 0,
                                                                'fopen@GLIBC_2.2.5' => 0,
                                                                'fputc@GLIBC_2.2.5' => 0,
                                                                'fputs@GLIBC_2.2.5' => 0,
                                                                'fread@GLIBC_2.2.5' => 0,
                                                                'free@GLIBC_2.2.5' => 0,
                                                                'freeaddrinfo@GLIBC_2.2.5' => 0,
                                                                'fstat@GLIBC_2.33' => 0,
                                                                'fwrite@GLIBC_2.2.5' => 0,
                                                                'gai_strerror@GLIBC_2.2.5' => 0,
                                                                'gcry_cipher_close@GCRYPT_1.6' => 0,
                                                                'gcry_cipher_decrypt@GCRYPT_1.6' => 0,
                                                                'gcry_cipher_encrypt@GCRYPT_1.6' => 0,
                                                                'gcry_cipher_open@GCRYPT_1.6' => 0,
                                                                'gcry_cipher_setkey@GCRYPT_1.6' => 0,
                                                                'gcry_md_close@GCRYPT_1.6' => 0,
                                                                'gcry_md_get_algo_dlen@GCRYPT_1.6' => 0,
                                                                'gcry_md_open@GCRYPT_1.6' => 0,
                                                                'gcry_md_read@GCRYPT_1.6' => 0,
                                                                'gcry_md_write@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_new@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_powm@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_print@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_randomize@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_release@GCRYPT_1.6' => 0,
                                                                'gcry_mpi_scan@GCRYPT_1.6' => 0,
                                                                'gcry_randomize@GCRYPT_1.6' => 0,
                                                                'getaddrinfo@GLIBC_2.2.5' => 0,
                                                                'getc@GLIBC_2.2.5' => 0,
                                                                'getenv@GLIBC_2.2.5' => 0,
                                                                'geteuid@GLIBC_2.2.5' => 0,
                                                                'gethostbyname@GLIBC_2.2.5' => 0,
                                                                'getnameinfo@GLIBC_2.2.5' => 0,
                                                                'getpeername@GLIBC_2.2.5' => 0,
                                                                'getpid@GLIBC_2.2.5' => 0,
                                                                'getpwuid@GLIBC_2.2.5' => 0,
                                                                'getrlimit@GLIBC_2.2.5' => 0,
                                                                'getsockopt@GLIBC_2.2.5' => 0,
                                                                'gettimeofday@GLIBC_2.2.5' => 0,
                                                                'gmtime@GLIBC_2.2.5' => 0,
                                                                'gnutls_bye@GNUTLS_3_4' => 0,
                                                                'gnutls_certificate_allocate_credentials@GNUTLS_3_4' => 0,
                                                                'gnutls_certificate_free_credentials@GNUTLS_3_4' => 0,
                                                                'gnutls_certificate_set_dh_params@GNUTLS_3_4' => 0,
                                                                'gnutls_certificate_set_x509_key_file@GNUTLS_3_4' => 0,
                                                                'gnutls_certificate_set_x509_trust_file@GNUTLS_3_4' => 0,
                                                                'gnutls_credentials_set@GNUTLS_3_4' => 0,
                                                                'gnutls_deinit@GNUTLS_3_4' => 0,
                                                                'gnutls_dh_params_generate2@GNUTLS_3_4' => 0,
                                                                'gnutls_dh_params_init@GNUTLS_3_4' => 0,
                                                                'gnutls_global_init@GNUTLS_3_4' => 0,
                                                                'gnutls_global_set_log_function@GNUTLS_3_4' => 0,
                                                                'gnutls_global_set_log_level@GNUTLS_3_4' => 0,
                                                                'gnutls_handshake@GNUTLS_3_4' => 0,
                                                                'gnutls_init@GNUTLS_3_4' => 0,
                                                                'gnutls_protocol_get_name@GNUTLS_3_4' => 0,
                                                                'gnutls_protocol_get_version@GNUTLS_3_4' => 0,
                                                                'gnutls_record_check_pending@GNUTLS_3_4' => 0,
                                                                'gnutls_record_recv@GNUTLS_3_4' => 0,
                                                                'gnutls_record_send@GNUTLS_3_4' => 0,
                                                                'gnutls_session_enable_compatibility_mode@GNUTLS_3_4' => 0,
                                                                'gnutls_set_default_priority@GNUTLS_3_4' => 0,
                                                                'gnutls_strerror@GNUTLS_3_4' => 0,
                                                                'gnutls_transport_set_ptr@GNUTLS_3_4' => 0,
                                                                'inet_addr@GLIBC_2.2.5' => 0,
                                                                'inflate' => 0,
                                                                'inflateEnd' => 0,
                                                                'inflateInit_' => 0,
                                                                'jpeg_CreateCompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_CreateDecompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_abort_compress@LIBJPEG_8.0' => 0,
                                                                'jpeg_abort_decompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_destroy_compress@LIBJPEG_8.0' => 0,
                                                                'jpeg_destroy_decompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_finish_compress@LIBJPEG_8.0' => 0,
                                                                'jpeg_finish_decompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_read_header@LIBJPEG_8.0' => 0,
                                                                'jpeg_read_scanlines@LIBJPEG_8.0' => 0,
                                                                'jpeg_resync_to_restart@LIBJPEG_8.0' => 0,
                                                                'jpeg_set_colorspace@LIBJPEG_8.0' => 0,
                                                                'jpeg_set_defaults@LIBJPEG_8.0' => 0,
                                                                'jpeg_set_quality@LIBJPEG_8.0' => 0,
                                                                'jpeg_start_compress@LIBJPEG_8.0' => 0,
                                                                'jpeg_start_decompress@LIBJPEG_8.0' => 0,
                                                                'jpeg_std_error@LIBJPEG_8.0' => 0,
                                                                'jpeg_write_scanlines@LIBJPEG_8.0' => 0,
                                                                'listen@GLIBC_2.2.5' => 0,
                                                                'localtime@GLIBC_2.2.5' => 0,
                                                                'lzo1x_1_compress' => 0,
                                                                'malloc@GLIBC_2.2.5' => 0,
                                                                'memcmp@GLIBC_2.2.5' => 0,
                                                                'memcpy@GLIBC_2.14' => 0,
                                                                'memmove@GLIBC_2.2.5' => 0,
                                                                'memset@GLIBC_2.2.5' => 0,
                                                                'mkdir@GLIBC_2.2.5' => 0,
                                                                'open@GLIBC_2.2.5' => 0,
                                                                'opendir@GLIBC_2.2.5' => 0,
                                                                'pipe@GLIBC_2.2.5' => 0,
                                                                'png_create_info_struct@PNG16_0' => 0,
                                                                'png_create_write_struct_2@PNG16_0' => 0,
                                                                'png_destroy_write_struct@PNG16_0' => 0,
                                                                'png_get_io_ptr@PNG16_0' => 0,
                                                                'png_set_IHDR@PNG16_0' => 0,
                                                                'png_set_compression_level@PNG16_0' => 0,
                                                                'png_set_filter@PNG16_0' => 0,
                                                                'png_set_write_fn@PNG16_0' => 0,
                                                                'png_write_end@PNG16_0' => 0,
                                                                'png_write_info@PNG16_0' => 0,
                                                                'png_write_row@PNG16_0' => 0,
                                                                'pthread_cond_destroy@GLIBC_2.3.2' => 0,
                                                                'pthread_cond_init@GLIBC_2.3.2' => 0,
                                                                'pthread_cond_signal@GLIBC_2.3.2' => 0,
                                                                'pthread_cond_wait@GLIBC_2.3.2' => 0,
                                                                'pthread_create@GLIBC_2.34' => 0,
                                                                'pthread_join@GLIBC_2.34' => 0,
                                                                'pthread_mutex_destroy@GLIBC_2.2.5' => 0,
                                                                'pthread_mutex_init@GLIBC_2.2.5' => 0,
                                                                'pthread_mutex_lock@GLIBC_2.2.5' => 0,
                                                                'pthread_mutex_unlock@GLIBC_2.2.5' => 0,
                                                                'putc@GLIBC_2.2.5' => 0,
                                                                'putchar@GLIBC_2.2.5' => 0,
                                                                'putenv@GLIBC_2.2.5' => 0,
                                                                'random@GLIBC_2.2.5' => 0,
                                                                'read@GLIBC_2.2.5' => 0,
                                                                'readdir@GLIBC_2.2.5' => 0,
                                                                'realloc@GLIBC_2.2.5' => 0,
                                                                'recvfrom@GLIBC_2.2.5' => 0,
                                                                'rename@GLIBC_2.2.5' => 0,
                                                                'rmdir@GLIBC_2.2.5' => 0,
                                                                'select@GLIBC_2.2.5' => 0,
                                                                'setsockopt@GLIBC_2.2.5' => 0,
                                                                'signal@GLIBC_2.2.5' => 0,
                                                                'snprintf@GLIBC_2.2.5' => 0,
                                                                'socket@GLIBC_2.2.5' => 0,
                                                                'srandom@GLIBC_2.2.5' => 0,
                                                                'stat@GLIBC_2.33' => 0,
                                                                'stderr@GLIBC_2.2.5' => 0,
                                                                'strcasecmp@GLIBC_2.2.5' => 0,
                                                                'strcat@GLIBC_2.2.5' => 0,
                                                                'strchr@GLIBC_2.2.5' => 0,
                                                                'strcmp@GLIBC_2.2.5' => 0,
                                                                'strcpy@GLIBC_2.2.5' => 0,
                                                                'strcspn@GLIBC_2.2.5' => 0,
                                                                'strdup@GLIBC_2.2.5' => 0,
                                                                'strerror@GLIBC_2.2.5' => 0,
                                                                'strftime@GLIBC_2.2.5' => 0,
                                                                'strlen@GLIBC_2.2.5' => 0,
                                                                'strncasecmp@GLIBC_2.2.5' => 0,
                                                                'strncmp@GLIBC_2.2.5' => 0,
                                                                'strncpy@GLIBC_2.2.5' => 0,
                                                                'strrchr@GLIBC_2.2.5' => 0,
                                                                'strstr@GLIBC_2.2.5' => 0,
                                                                'strtol@GLIBC_2.2.5' => 0,
                                                                'time@GLIBC_2.2.5' => 0,
                                                                'uncompress' => 0,
                                                                'unlink@GLIBC_2.2.5' => 0,
                                                                'usleep@GLIBC_2.2.5' => 0,
                                                                'utime@GLIBC_2.2.5' => 0,
                                                                'write@GLIBC_2.2.5' => 0
                                                              }
                                },
          'WordSize' => '8'
        };
